/*============================================================================*/
/**  @file      sdl_string_dialog.cpp
 **  @ingroup   zhongcan_sdl
 **  @brief		Edit string.
 **
 **  Edit a string, e.g. to enter an item name in chinese.
 **
 **  @author     mensfort
 **
 **  @par Classes:
 **              CstringDialog
 */
/*------------------------------------------------------------------------------
 **  Copyright (c) Bart Houkes, 29 mrt 2011
 **
 **  Copyright notice:
 **  This software is property of Bart Houkes.
 **  Unauthorized duplication and disclosure to third parties is forbidden.
 **============================================================================*/

/*------------- Standard includes --------------------------------------------*/
#if 1
#include "sdl_string_dialog.h"
#include "swype_items_dialog.h"
#include "graphics_widgets.h"
#include "log_base.h"
#include "zhongcan_conf.h"
#include "keyboard.h"
#include "sql_menu_translation_iterator.h"
#include "zhongstring.h"
#include "chinese_unicode.h"
#include "global.h"
#include "money.h"
#include "zhongcan_icon.h"

const int RADWIDTH =7; ///< Width of a radical.
const int RADHEIGHT =6; ///< Height of a radical.
const int SYMWIDTH =6; ///< Symbol width.
const int SYMHEIGHT =6; ///< Symbol height.
const int ITEMWIDTH =20; ///< Width of any item on screen.

/// @brief Radical structure.
struct Sradical
{
	int  index;	///< Which radical.
	const std::string radical; ///< Name of the radical.
	const std::string characters; ///< Characters belonging to this radical.
};

#define RADICAL_COUNT 214 ///< Number of radicals.

/// @brief Data for each radical.
const Sradical radicalData[RADICAL_COUNT]=
{
{ 1,"一", "丁丂七丄丅丆 万丈三上下丌亐卄 不与丏丐丑丒专丗㐀且丕世丘丙业丛东丝㐁㐂丞丟丠両丣两严丽並丧" },
{ 2,"丨", "丨丩㐃㐄个丫中丮丯丰书丱串串丳临丵" },
{ 3,"丶", "丶丷丸义丹为丹主丼举" },
{ 4,"丿", "丿乀乁㐅乂乃乄久乆乇么乊之乌乍乎乏乐㐆乑丢乒乓乔乕秉乖乗乘粤"},
{ 5, "乙", "乙乚乛乜九㐇㐈㐉乞也㐊㐋乣乤乥㐌㐍㐎㐏乧㐐㐑㐒㐓㐔㐕乨乩乪乫乬乭乮乯买㐖㐗㐘乱乲㐙㐚㐛乳乴乵乶乷乸㐜㐝㐞㐟㐠乹乺乻乼乽㐡㐢㐣乾乿亀㐤亁亂亃亄亂㐥㐦)"},
{ 6, "亅", "亅了亇㐧予争亊㐨事" },
{ 7, "二", "二亍于亏云互亓五井亖亗亘亙亚些亜㐩亝亞亟"},
{ 8, "亠", "亠亡亢亣㐪㐫交亥亦产㐬亨亩亪㐭享京亭亮亯亰亱亲亮亳高亴亵㐮亶亷亸㐯s亹"},
{ 9, "人", "人亻亼亽亾亿什仁仂仃仄仅仆仇仈仉今介仌仍从仏仐仑仒仓㐰㐱㐲㐳㐴㐵㐶㐷仔仕他仗付仙仚仛仜仝仞仟仠仡仢代令以仦仧仨仩仪仫们仭令㐸㐹㐺㐻㐼㐽㐾㐿㑀仮仯仰仱仲仳仴仵件价仸仹仺任仼份仾仿伀企伂伃伄伅伆伇伈伉伊伋伌伍伎伏伐休伒伓伔伕伖众优伙会伛伜伝伞伟传伡伢伣伤伥伦伧伨伩伪伫伬佤㑁㑂㑃㑄㑅㑆㑇㑈伭伮伯估伱伲伳伴伵伶伷伸伹伺伻似伽伾伿佀佁佂佃佄佅但佇佈佉佊佋佌位低住佐佑佒体佔何佖佗佘余佚佛作佝佞佟你佡佢佣佥佦佧佨㑉㑊㑋㑌㑍㑎㑏㑐㑑㑒㑓㑔㑕㑖佩佪佫佬佭佮佯佰佱佲佳佴併佶佷佸佹佺佻佼佽佾使侀侁侂侃侄侅來侇侈侉侊例侌侍侎侏侐侑侒侓侔侕侖侗侘侙侚供侜依侞侟侠価侢侣侤侥侦侧侨侩侪侫侬侭來例㑗㑘㑙㑚㑛㑜㑝㑞㑟㑠㑡㑢侮侯侰侱侲侳侴侵侶侷侸侹侺侻侼侽侾便俀俁係促俄俅俆俇俈俉俊俋俌俍俎俏俐俑俒俓俔俕俖俗俘俙俚俛俜保俞俟俠信俢俣俤俥俦俧俨俩俪俫俬俭便㑣㑥㑦㑧㑨㑩㑪㑫㑬㑭修俯俰俱俲俳俴俵俶俷俸俹俺俻俼俽俾俿倀倁倂倃倄倅倆倇倈倉倊個倌倍倎倏倐們倒倓倔倕倖倗倘候倚倛倜倝倞借倠倡倢倣値倥倦倧倨倩倪倫倬倭倮倯倰倱倲倳倴倵倶倷倸倹债倻值倽倾倿倫㑤㑮㑯㑰㑱㑲偀偁偂偃偄偅偆假偈偉偊偋偌偍偎偏偐偑偒偓偔偕偖偗偘偙做偛停偝偞偟偠偡偢偣偤健偦偧偨偩偪偫偬偭偮偯偰偱偲偳側偵偶偷偸偹偺偻偼偽偾偿㑳㑴㑵㑶㑷㑸㑹㑺傀傁傂傃傄傅傆傇傈傉傊傋傌傍傎傏傐傑傒傓傔傕傖傗傘備傚傛傜傝傞傟傠傡傢傣傤傥傦傧储傩㑻㑼㑽㑾㑿㒀㒁傪傫催傭傮傯傰傱傲傳傴債傶傷傸傹傺傻傼傽傾傿僀僁僂僃僄僅僆僇僈僉僊僋僌働㒂㒃㒄㒅㒆㒇㒈㒉㒊㒋㒌㒍㒎㒏㒐僎像僐僑僒僓僔僕僖僗僘僙僚僛僜僝僞僟僠僡僢僣僤僥僦僧僨僩僪僫僬僭僮僯僰僱僳僴僷儰僚㒑㒒㒓㒔㒕㒖㒗㒘僲僵僶僸價僺僻僼僽僾僿儀儁儂儃億儅儆儇儈儉儊儋儌儍儎儏㒙㒚㒛㒜儐儑儒儓儔儕儖儗儘儙儚儛儜儝儞儫㒝㒞償儠儡儢儣儤儥儦儧儨儩優儬㒟㒠儭儮儯儱儲㒡㒢㒣儳儴儵㒤㒥㒦儶㒧㒨儷儸儹儺儻儼㒩儽儾㒪"},
{ 10, "儿", "儿兀允兂元兄充㒫兆兇先光兊克兌兎兏児兑㒬免兒兓兔兕兖兗兘兙㒭党兛㒮兜兝兞兟兠兡兢兣㒯兤"},
{ 11, "入", "入兦內㒰㒱㒲全㒳㒴兩兪"},
{ 12, "八", "八公六兮兯兰共兲关兴㒵㒶㒷兵其具典㒸兹养兺兼兽兾兿冀冁㒹"},
{ 13, "冂", "冂冃冄内円冇冈冉冊冋册再冎冏㒺冐冑冒冓冔㒻㒼冕㒽㒾㒿"},
{ 14, "冖", "冖㓀㓁冗冘写冚军农冝冞㓂冟冠冡冢冣冤冥冦冧冨㓃冩㓄冪"},
{ 15, "冫", "冫习㓅冬冭冮冯㓆㓇冰冱冲决冴㓈况冶冷冸冹冺冻冷㓉㓊㓋㓌㓍冼冽冾冿净㓎㓏凁凂凃㓐㓑㓒凄凅准凇凈凉凊凋凌凍凎凌凉㓓减凐凑㓔㓕凒凓凔凕凖㓖凗㓗凘凙凚凛凜凜凝凞凞凟"},
{ 16, "几", "几凡凢凣凤凥処凧凨凩凪凫凬凭凮凯㓘凰凱凲凳凴"},
{ 17, "凵", "凵凶凷凸凹出击㓙凼函凾"},
{ 18, "刀刂","刀刁刂刃刄刅分切刈切㓚㓛㓜刉刊刋刌刍㓝㓞刎刏刐刑划刓刔刕刖列刘则刚创列㓟㓠刜初刞刟删刡刢刣判別刦刧刨利刪别刬刭利㓡㓢㓣㓤㓥㓦刮刯到刱刲刳刴刵制刷券刹刺刻刼刽刾刿剀剁剂刺㓧㓨㓩㓪㓫剃剄剅剆則剈剉削剋剌前剎剏剐剑㓬㓭㓮㓯㓰剒剓剔剕剖剗剘剙剚剛剜剝剞剟剠剡剢剣剤剥剦剧㓱㓲㓳㓴㓵㓶剨剪剫剬剭剮副剰剱剶㓷㓸㓹㓺㓻剩割剳剴創㓼㓽剷剸剹剺剻剼剽剾剿㓾㓿㔀㔁㔂㔃㔄㔅㔆㔇㔈㔉劀劁劂劃劄㔊劅劆劇劈劉劊劋劌劍劎劏劉㔋㔌㔍劐劑劒劓劔㔎㔏劕㔐㔑劖㔒劗劘劙劚"},
{ 19, "力", "力劜劝办㔓㘞功加务劢㔔㔕㔖劣劤劥劦劧动劣㔗㔘助努劫劬劭劮劯劰励劲劳労㔙㔚㔛劵劶劷劸効劺劻劼劽劾势㔜勀勁勂勃勄勅勆勇勈勉勊勋㔝㔞㔟勌勍勎勏勐勑㔠勒勓勔動勖勗勘務勚勒㔡勛勜勝勞勞募勠勡勢勣勤勥勦勧㔢勨勩勪勫勬勭勮勯勰勱勲勳㔣㔤㔥㔦勴勵勶勵㔧勷勸"},
{ 20, "勹", "勹勺勻勼勽勾勿匀匁匂匃匄包匆匇匈匉匊匋匌匍匎㔨匏匐㔩匑匒㔪匓匔" },
{ 21, "匕", "匕㔫化北㔬㔭匘匙"},
{ 22, "匚", "匚匛匜匝匞匟匠匡匢㔯㔰匣匤匥匦匧匨匩匪匫㔱匬匭匮㔲㔳㔴匯㔵匰匱匲匳匴匵匶匷㔶"},
{ 23, "匸", "匸匹区㔷医匼匽匾匿區匿㔸"},
{ 24, "十", "十卂千㔹卅卆升午卉半卌㔺㔻卋卍华协卐卑卒卓協单卖南単卙博㔼卛"},
{ 25, "卜", "卜卝卞卟占卡卢卣卤㔽卥卦卧卨"},
{ 26, "卩", "卩㔾㔿卪卫卬卭卮卯印危㕀卲即却卵卵㕁卶卷卸卹卺卻卼卽卾卿厀厁"},
{ 27, "厂", "厂厃厄厅历)厇厈厉㕂㕃㕄厊压厌厍㕅㕆㕇厎厏厐厑㕈㕉厒厓厔厕㕊厖厗厘厙厚厛㕋㕌㕍厜厝厞原厠厡厢厣厩㕎厤厥厦厧厨㕏厪厫㕐㕑厬厭厮厯厰㕒厱厲㕓厳厴㕔厵"},
{ 28, "厶", ")厶㕕厷厸厹s厺去厼厽厾县叀叁参㕖㕗㕘參叄參叅叆㕙叇" },
{ 29, "又", "又叉㕚㕛及友双反収叏叐发㕜叒㕝叓㕞叔叕取受变㕟叙叚叛叜叝叞叟㕠叠﨎㕡叡叢壡" },
{ 30, "口", "口㕣㕤㕥古句另叧叨叩只叫召叭叮可台叱史右叴叵叶号司叹叺叻叼叽叾句㕦㕧㕨叿吀吁吂吃各吅吆吇合吉吊吋同名后吏吐向吒吓吔吕吖吗吏㕩㕪㕫㕬㕭㕮㕯㕰㕱㕲㕳㕴㕵㕶吘吙吚君吜吝吞吟吠吡吢吣吤吥否吧吨吩吪含听吭吮启吰吱吲吳吴吵吶吷吸吹吺吻吼吽吾吿呀呁呂呃呄呅呆呇呈呉告呋呌呍呎呏呐呑呒呓呔呕呖呗员呙呚呛呜呂吝𠱁㕷㕸㕹㕺㕻㕼㕽㕾㕿呝呞呟呠呡呢呣呤呥呦呧周呩呪呫呬呭呮呯呰呱呲味呴呵呶呷呸呹呺呻呼命呾呿咀咁咂咃咄咅咆咇咈咉咊咋和咍咎咏咐咑咒咓咔咕咖咗咘咙咚咛咜咝㖀㖁㖂㖃㖄㖅㖆㖇㖈㖉㖊㖋㖌㖍㖎咞咟咠咡咢咣咤咥咦咧咨咩咪咫咬咭咮咯咰咱咲咳咴咵咶咷咸咹咺咻咼咽咾咿哀品哂哃哄哅哆哇哈哉哊哋哌响哎哏哐哑哒哓哔哕哖哗哘哙哚哛哜哝哞哟咽㖏㖐㖑㖒㖓㖔㖕㖖㖗㖘㖙㖚㖛㖜㖝㖞哠員哢哣哤哥哦哧哨哩哪哫哬哭哮哯哰哱哲哳哴哵哶哷哸哹哺哻哼哽哾哿唀唁唂唃唄唅唆唇唈唉唊唋唌唍唎唏唐唑唒唓唔唕唖唗唘唙唚唛唜唝唞唟唠唡唢唣唤唥唦唧㖟㖠㖡㖢㖣㖤㖥㖦㖧㖨㖩㖪㖫㖬㖭㖮㖯㖰㖱㖲㖳㖴㖵唨唩唪唫唬唭售唯唰唱唲唳唴唵唶唷唸唹唺唻唼唽唾唿啀啁啂啃啄啅商啇啈啉啊啋啌啍啎問啐啑啒啓啔啕啖啗啘啚啛啜啝啞啠啡啢啣啤啥啦啧啨啩啪啬啭啮啯啰啱啲啳啴啵啶啷啸啹㖶㖷㖸㖹㖺㖻㖼㖽㖾㖿㗀㗁㗂㗃㗄㗅㗆㗇㗈㗉㗊㗋㗌㗍㗎㗏㗐㗑啙啫啺啻啼啽啾啿喀喁喂喃善喅喆喇喈喉喊喋喌喎喏喐喑喒喓喔喕喖喗喘喙喚喛喜喝喞喟喠喡喢喣喤喥喦喧喨喩喪喫喬喭單喯喰喱喲喳喴喵営喷喸喹喺喻喼喽喾噅喇㗒㗓㗔㗕㗖㗗㗘㗙㗚㗛㗜㗝㗞㗟㗠㗡喍喿嗀嗁嗂嗃嗄嗅嗆嗇嗈嗉嗊嗋嗌嗍嗎嗏嗐嗑嗒嗓嗔嗕嗖嗗嗘嗙嗚嗛嗜嗝嗞嗟嗠嗡嗢嗣嗤嗥嗦嗧嗨嗩嗪嗫嗬嗭嗮嗯嗰嗱嗲嗳嗴嗵嗀㗢㗣㗤㗥㗦㗧㗨㗩㗪㗫㗬㗭㗮㗯㗰嗶嗷嗸嗹嗺嗻嗼嗽嗾嗿嘀嘁嘂嘃嘄嘅嘆嘇嘈嘉嘊嘋嘌嘍嘎嘏嘐嘑嘒嘓嘔嘕嘖嘗嘘嘙嘚嘛嘜嘝嘞嘡嘢嘣嘤嘥嘦嘧噑噓㗱㗲㗳㗴㗵㗶㗷㗸㗹㗺嘟嘠嘨嘩嘪嘫嘬嘭嘮嘯嘰嘱嘲嘳嘴嘵嘶嘷嘸嘹嘺嘻嘼嘽嘾嘿噀噁噂噃噄噆噇噈噉噊噋噌噍噎噏噐噒噔噖噗噘噙噚噛噜噝噴㗻㗼㗽㗾㗿㘀㘁㘂㘃㘄噞噟噠噡噢噣噤噥噦噧器噩噪噫噬噭噮噯噰噱噲噳噵噶噷噸噹噺噻噼㘅㘆㘇㘈噽噾噿嚀嚁嚂嚃嚄嚅嚆嚇嚈嚉嚊嚋嚌嚍嚎嚏嚐嚑嚒嚓嚺𡃁㘉㘊㘋㘌㘍㘎㘏嚔嚕嚖嚗嚘嚙嚚嚛嚜嚝嚞嚟嚠嚡嚢嚣嚤㘐㘑㘒嚥嚦嚧嚨嚩嚪嚫嚬嚭嚮嚯嚰㘓㘔嚱嚲嚳嚴嚵嚶嚷嚸嚹㘕㘖㘗嚻嚼嚽嚾嚿囀囁囂囃囄囍㘘囅囆囇囈囉囊囋囎㘙㘚囌囏囐囑囒囓㘛囔囕㘜囖" },
{ 31, "囗", "囗㘝囘囙囚四囜㘟囝回囟因囡团団囤囥囦囧囨囩囪囫囬园囮囯困囱囲図围囵㘠㘡囶囷囸囹固囻囼国图囹㘢囿圀㘣圁圂圃圄圅圆圇圈圉圊國圏圌圍圎圐圑園圓圔圕㘤圖圗團圙圚圛圜㘥圝圞" },
{ 32, "土", "土圠圡㘦圢圣圤圥圦圧在圩圪圫圬圭圮圯地圱圲圳圴圵圶圷圸圹场㘧㘨㘩㘪㘫㘬㘭㘮㘯㘰圻圼圽圾圿址坁坂坃坄坅坆均坈坉坊坋坌坍坎坏坐坑坒坓坔坕坖块坘坙坚坛坜坝坞坟坠㘱㘲㘳㘴㘵坡坢坣坤坥坦坧坨坩坪坫坬坭坮坯坰坱坲坳坴坵坶坷坸坹坺坻坼坽坾坿垀垁垂垃垄垅垆垇垈垉垊㘶㘷㘸㘹㘺㘻㘼㘽㘾型垌垍垎垏垐垑垒垓垔垕垖垗垘垙垚垛垜垝垞垟垠垡垢垣垤垥垦垧垨垩垪垫垬垭垮垯垰垱垲垳垴垵城㘿㙀㙁㙂㙃㙄㙅㙆垶垷垸垹垺垻垼垽垾垿埀埁埂埃埄埅埆埇埈埉埊埋埌埍埏埐埑埒埓埔埕埖埗埘埙埚埛﨏㙇㙈㙉㙊㙋㙌㙍埜埝埞域埠埡埢埣埤埥埦埧埨埩埫埬埭埮埯埰埱埲埳埴埵埶執埸培基埻埼埽埾埿堀堁堂堃堄堅堆堇堈堉堊堋堌堍堎堏堐堑堒堓堔堕㙎㙏㙐㙑㙒㙓㙔㙕㙖㙗㙘埪堖堗堘堙堚堛堜堝堞堟堠堡堢堣堤堥堦堧堨堩堪堫堬堭堮堯堰報堲堳場堵堶堷堸堹堺堻堼堾堿塀塁塂塄塅塆塇塈㙙㙚㙛㙜㙝㙞㙟堽塃塉塊塋塌塍塎塏塐塑塒塓塔塕塖塗塘塙塚塛塜塝塞塟塠塡塢塣塤塥塦塧塨塩塪填塬塭塮塯塰塱塞塚㙠㙡㙢㙣㙤㙥㙦塲塳塴塵塶塷塸塹塺塻塼塽塾塿墀墁墂境墄墅墆墇墈墉墊墋墌墍墎墏墐墑墒墓墔墕墖増墘墙墚墛㙧㙨㙩㙪㙫㙬㙭㙮㙯墜墝增墟墠墡墢墣墤墥墦墧墨墩墪墫墬墭墮墯墰墱墲墳墴墵墶墷墸墹㙰㙱㙲㙳㙴㙵㙶墺墻墼墽墾墿壀壁壂壃壄壅壆壇壈壉壊壋壌㙷㙸㙹㙺壍壎壏壐壑壒壓壔壕壖壗㙻㙼㙽壘壙壘㙾㙿壚壛壜壝壞壟壠壢壟㚀壣壤壥壦壧壨㚁壩㚂壪" },
{ 33, "士", "士壬壭壮壯声壱売壳壴壵壶壷壸㚃壹壺壻喜壼壽壾㚄壿夀夁" },
{ 34, "夂", "夂夃处夅夆备㚅夈" },
{ 35, "夊", "夊夋夌㚆㚇変复夎夏夐夑夓夒夔" },
{ 36, "夕", "夕㚈外夗夘夙多夛㚉夜夝夞够夠㚊夡㚋㚌夢夣夤夥夦㚍" },
{ 37, "大", "大夨天太夫夬夭㚎央夯夰失夲夳头㚏㚐㚑夵夶夷夸夹夺夻夼㚒㚓夽夾夿奀奁奂㚔㚕㚖㚗㚘㚙奃奄奅奆奇奈奉奋奌奍奈㚚㚛奎奏奐契奒奓奔奕奖契奊套奘奙奚㚜㚝㚞奛奜奝奞㚟奟奠奡奢奣奤奥㚠奦奧奨奩奪奫奬奭㚡奮奯奰奱奲" },
{ 38, "女", "女㚢奴奵奶㚣㚤㚥㚦㚧㚨奷奸她奺奻奼好奾奿妀妁如妃妄妅妆妇妈㚩㚪㚫㚬㚭㚮㚯㛠妉妊妋妌妎妏妐妑妒妓妔妕妖妗妘妙妚妛妜妝妞妟妠妡妢妣妤妥妦妧妨妩妪妫㚰㚱㚲㚳㚴㚵㚶㚷㚸㚹㚺㚻㚼㚽㚾㚿㛀㛁妬妭妮妯妰妱妲妳妴妵妶妷妸妹妺妻妼妽妾妿姀姁姂姃姄姅姆姇姈姉姊始姌姍姎姏姐姑姒姓委姕姖姗㛂㛃㛄㛅㛆㛇㛈㛉㛊㛋㛌妍姘姙姚姛姜姝姞姟姠姡姢姣姤姥姦姧姨姩姪姫姭姮姯姰姱姲姳姴姵姶姷姸姹姺姻姼姽姾姿娀威娂娃娅娆娇娈㛍㛎㛏㛐㛑㛒㛓㛔㛕㛖㛗㛘㛙㛚㛛㛜㛝㛞㛟㛡㛢㛣㛤姬娉娊娋娌娍娎娏娐娑娒娓娔娕娖娗娘娙娚娛娜娝娞娟娠娡娢娣娤娥娦娧娨娩娪娫娭娮娯娰娱娲娳娴娽㛥㛦㛧㛨㛩㛪㛫㛬㛭娬娵娶娷娸娹娺娻娼娾娿婀婁婂婃婄婅婆婇婈婉婊婋婌婍婎婏婐婑婒婓婔婕婖婗婘婙婚婛婜婝婞婟婠婡婢婣婤婥婦婧婨婩婪婫婬婭婮婯婰婱婲婳婴婵婶㛮㛯㛰㛱㛲㛳㛴㛵㛶㛷㛸㛹㛺㛻㛼㛽㛾㛿㜀㜁㜂㜃㜄婷婸婹婺婻婼婽婾婿媀媁媂媃媄媅媆媇媈媉媊媋媌媍媎媏媑媒媓媔媕媖媗媘媙媚媛媜媝媞媟媠媡媢媣媤媥媦媧媨媩媪媫媬媭媮媯嫏㜅㜆㜇㜈㜉㜊㜋㜌㜍㜎㜏㜐㜑㜒㜓㜔媐媰媱媲媳媴媵媶媷媸媹媺媻媼媽媾媿嫀嫁嫂嫃嫄嫅嫆嫇嫈嫉嫊嫋嫌嫍嫎嫐嫑嫒嫓嫔㜕㜖㜗㜘㜙㜚㜛㜜㜝㜞㜟㜠㜡㜢嫕嫖嫗嫘嫙嫚嫛嫜嫝嫞嫟嫠嫡嫢嫣嫤嫥嫦嫧嫨嫩嫪嫫嫬嫭嫮嫯嫰嫱嫲㜣㜤㜥㜦㜧㜨嫳嫴嫵嫶嫷嫸嫹嫺嫻嫼嫽嫾嫿嬀嬁嬂嬃嬄嬅嬆嬇嬈嬉嬊嬋嬌嬍嬎嬏㜩㜪㜫㜬㜭嬐嬑嬒嬓嬔嬕嬖嬗嬘嬙嬚嬛嬜嬝嬞嬟嬠嬡嬢嬴㜮㜯嬣嬤嬥嬦嬧嬨嬩嬪嬫嬬嬭嬮嬯嬰嬱嬲嬳嬵嬶嬷㜰㜱嬸嬺嬻嬼嬽㜲㜳㜴㜵嬹嬾嬿㜶㜷㜸孀孁孂孃孄孅孆㜹孇孈孉䶯㜺孊孋孌孍孎孏㜻㜼" },
{ 39, "子", "子孑孒孓孔孕㜽孖字存孙㜾㜿孚孛孜孝孞㝀孟孠孡孢季孤孥学孧㝁孨孩孪㝂㝃孫孬孭孮孯孰孲㝄孱㝅孳孴孵孶孷㝆㝇學孹孺孻孼孽孾孿㝈" },
{ 40, "宀", "宀㝉㝊㝋宁宂它宄㝌㝍宅宆宇守安宅㝎㝏㝐㝑宊宋完宍宎宏宐宑宒㝒宓宔宕宖宗官宙定宛宜宝实実宠审㝓㝔㝕㝖客宣室宥宦宨宩宪宫㝗㝘㝙㝚宧宬宭宮宯宰宱宲害宴宵家宷宸容宺宻宼宽宾㝛㝜㝝㝞㝟㝠㝡空宿寀寁寂寃寄寅密寇寈寉㝢㝣寊寋富寍寎寏寐寑寒寓寔寕寪㝤㝥㝦㝧㝨寖寗寘寙寚寛寜寝㝩㝪㝫㝬寞察寠寡寢寣寤寥實寧寨寧寧㝭㝮㝯審寫寬寭寮寮寯寰寱寲㝰寳寴寵寶㝱寷㝲" },
{ 41, "寸", "寸㝳对寺寻导㝴寽対寿㝵尀封専将㝶尃射尅將專尉㝷尊尋尌對導" },
{ 42, "小", "小尐少尒尓尔尕尖尗尘尙尚尛尜尝㝸㝹尞尟尠㝺尡㝻" },
{ 43, "尢", "尢尣尤㝼尥尦尧㝽尨尩尪尫尬㝾㝿尭㞀㞁尮尯㞂㞃㞄㞅㞆㞇㞈尰就㞉㞊尲尳尴尵尶尷" },
{ 44, "尸", "尸尹尺㞋尻尼㞌㞍尽㞎尾尿局屁层屃尿㞏㞐㞑屄居屆屇屈屉届㞒㞓㞔㞕㞖屋屌屍屎屏㞗屐屑屒屓屔展屖屗屘㞘㞙屙屚屛屜屝㞚㞛属屟屠屡㞝㞝尉屢屣屢㞟㞠層履屦屧履屨屩屪㞡屫屬屭" },
{ 45, "屮", "屮㞢屯屰㞣㞷" },
{ 46, "山", "山乢屲㞤㞥㞦㞧屳屴屵屶屷㞨㞩㞪㞫㞬㞭㞮㞯屸屹屺屻屼屽屾屿岀岁岂岃㞰㞱㞲㞳㞴㞵㞶㞸岄岅岆岇岈岉岊岋岌岎岏岐岑岒岓岔岕岖岗岘岙岚岛岜㞹㞺㞻㞼㞽㞾㞿㟀㟁㟂㟃岝岞岟岠岡岢岣岤岥岦岧岨岩岪岫岬岭岮岯岰岱岲岳岴岵岶岷岸岹岺岻岼岽岾岿峀峁峂峃峄峅㟄㟅㟆岍峆峇峈峉峊峋峌峍峎峏峐峑峒峓峔峕峖峗峘峙峚峛峜峝峞峟峠峡峢峣峤峥峦峧㟇㟈㟉㟊㟋㟌㟍㟎㟏㟐㟑㟒㟓㟔㟕㟖峨峩峪峫峬峭峮峯峰峱峲峳峴峵島峷峸峹峺峻峼峽峾峿崀崁崂崃崄崅㟗㟘㟙㟚㟛㟜㟝㟞㟟㟠㟡㟢㟣㟤㟥崆崇崈崉崊崋崌崍崎崏崐崑崒崓崔崕崖崗崘崙崚崛崜崝崞崟崠崡崢崣崤崥崦崧崨崩崪崫崬崭崮崯崰崙㟦㟧㟨㟩㟪㟫㟬㟭㟮㟯崱崲崳崴崵崶崷崸崹崺崻崼崽崾崿嵀嵁嵂嵃嵄嵅嵆嵇嵈嵉嵋嵌嵍嵎嵏嵐嵑嵒嵓嵔嵕嵖嵗嵘嵙嵚嵛嵜嵝嵐﨑㟰㟱㟲㟳㟴㟵㟶㟷㟸嵊嵞嵟嵠嵡嵢嵣嵤嵥嵦嵧嵨嵩嵪嵫嵬嵭嵮嵯嵰嵱嵲嵳嵴嵵嵶㟹㟺㟻㟼㟽㟾㟿㠀㠁㠂㠃㠄嵷嵸嵹嵺嵻嵼嵽嵾嵿嶀嶁嶂嶃嶄嶅嶆嶇嶈嶉嶊嶋嶌嶍嶎㠅㠆㠇㠈㠉㠊㠋㠌㠍㠎㠏㠐嶏嶐嶑嶒嶓嶔嶕嶖嶗嶘嶙嶚嶛嶜嶝嶞嶟嶠嶡嶢嶣嶤嶥㠑㠒㠓㠔㠕㠖㠗嶦嶧嶨嶩嶪嶫嶬嶭嶮嶯嶰嶱嶲嶳嶴嶵嶶㠘㠙㠚㠛㠜嶷嶸嶹嶺嶼嶽嶾嶿嶺㠝㠞㠟巀巁巂㠠㠡㠢㠣嶻巃巄巅㠤巆巇巈巉巊巋巌㠥㠦巍巏巐㠧巎巑巒巓巔巕巗巖巘巙巚㠨" },
{ 47, "巛", "巛巜川㠩州巟巠巡巢巣巤" },
{ 48, "工", "工㠪左巧巨巩巪巫巬巭㠫㠬差㠭巯巰㠮" },
{ 49, "己", "己已巳巴㠯巵㠰巶巷巸巹巺巻巼㠱巽" },
{ 50, "巾", "巾巿帀币㠲㠳市布帄帅㠴㠵㠶帆帇师㠷㠸㠹㠺㠻㠼帉帊帋希帍帎帏帐㠽㠾㠿㡀帑帒帓帔帕帖帗帘帙帚帛帜㡁㡂㡃㡄㡅㡆帝帞帟帠帡帢帣帤帥带帧㡇㡈帨帩帪師帬席帮帯帰帱㡉㡊㡋㡌㡍㡎帲帳帴帵帶帷常帹帺帻帼㡏㡐㡑㡒㡓㡔㡕㡖帽帾帿幀幁幂幃幄幅幆幇幉㡗㡘㡙㡚㡛幊幋幌幍幎幏㡜㡝㡞㡟幈幑幒幓幔幕幖幗幘幙幛㡠㡡幚幜幝幞幟幠幡幢幣幤幥㡢㡣㡤幦幧幨幩㡥㡦幪幫幬幭幮幯幰㡧㡨幱㡩㡪" },
{ 51, "干", "干平年幵并幷幸幹" },
{ 52, "幺", "乡幺幻幼幽㡫㡬幾㡭㡮" },
{ 53, "广", "广庀庁庂広㡯㡰㡱庄庅庆㡲㡳庇庈庉床庋庌庍庎序庐庑庒库应庘㡴㡵㡶㡷㡸㡹㡺㡻底庖店庙庚庛府庝庞废㡼㡽㡾㡿㢀㢁㢂庠庡庢庣庤庥度㢃㢄㢅㢆㢇座庨庩庪庫庬庭庮庯㢈㢉㢊㢋㢌庰庱庲庳庴庵庶康庸庹庺庻庼㢍㢎㢏㢐庽庾庿廀廁廂廃廊廊㢑廅廆廇廈廉廋廌廉㢒㢓㢔㢕廄廍廎廏廐廑廒廓廔廕廖廗廘廓㢖㢗㢘廙廚廛廜廝廞廟廠廡廢廣廤㢙㢚㢛㢜廥廦廧廨廩廪廫㢝廬廭廬㢞廮廯廰廱廲廳" },
{ 54, "廴", "廴㢟廵延廷㢠廸廹建廻廼廽" },
{ 55, "廿", "廾廿开弁异弃弄弅弄弆弇弈弉㢡㢢弊㢣" },
{ 56, "弋", "弋弌弍弎式弐㢤㢥弑㢦弒" },
{ 57, "弓", "弓㢧弔引弖弗弘㢨㢩㢪㢫弙弚弛弜㢬㢭弝弞弟张㢮㢯㢰㢱弡弢弣弤弥弦弧弨弩弪㢲㢳㢴㢵㢶㢷弫弬弭弮弯㢸㢹弰弱弲弳㢺㢻㢼弴張弶強弸弹㢽㢾㢿强弻弼弽弾㣀㣁㣂弿彀彁彂㣃彃彄彅㣄㣅彆彇彈彉彊彋彌彍㣆彎彏" },
{ 58, "彐", "彐彑归当㣇彔录彖彗彘彙彚㣈彛彜彝彞彟彠" },
{ 59, "彡", "彡㣉㣊形彣彤㣋㣌㣍彥彦彧彨㣎彩彪彫彬㣏㣐彭彮㣑彯彰㣒影㣓彲" },
{ 60, "彳", "彳㣔㣕彴彵㣖㣗彶彷彸役彺彻㣘㣙彼彽彾彿往征徂徃径㣚㣛㣜㣝㣞㣟㣠㣡待徆徇很徉徊律後徍徔律㣢㣣徎徏徐徑徒従徕㣤㣥㣦㣧㣨㣩徖得徘徙徛徜徝從徟徠御徢徣徤㣪㣫㣬㣭㣮徚徥徦徧徨復循徫復㣯徬徭微徯徰㣰㣱㣲徱徳徴㣳㣴徲徵徶德徸徹徺㣵㣶徻徼㣷徽徾㣸徿㣹忀忁忂" },
{ 61, "心", "心忄㣺必忆㣻忇忈忉忊㣼㣽㣾㣿㤀忋忌忍忎忏忐忑忒忓忔忕忖志忘忙忚忛応㤁㤂㤃㤄㤅㤆㤇㤈㤉㤊㤋忝忞忟忠忡忢忣忤忥忦忧忨忩忪快忬忭忮忯忰忱忲忳忴念忶忷忸忹忺忻忼忽忾忿怀态怂怃怄怅怆念㤌㤍㤎㤏㤐㤑㤒㤓㤔㤕㤖㤗㤘㤙怇怈怉怊怋怌怍怎怏怐怑怒怓怔怕怖怗怘怙怚怛怜思怞怟怠怡怢怣怤急怦性怨怩怪怫怬怭怮怯怰怱怲怳怴怵怶怷怸怹怺总怼怽怾怿怒怜㤚㤛㤜㤝㤞㤟㤠㤡㤢㤣㤤㤥㤦㤧㤨㤩㤪㤫㤬㤭㤺恀恁恂恃恄恅恆恇恈恉恊恋恌恍恎恏恐恑恒恓恔恕恖恗恘恙恚恛恜恝恞恟恠恡恢恣恤恥恦恧恨恩恪恫恬恭恮息恰恱恲恳恴恵恶恷恸恹恺恻恼恽㤮㤯㤰㤱㤲㤳㤴㤵㤶㤷㤸㤹㤻㤼㤽恾恿悀悁悂悃悄悅悆悇悈悉悊悋悌悍悎悏悐悑悒悓悔悕悖悗悘悙悚悛悜悝悞悟悠悡悢患悤悥悦悧您悩悪悫悬悭悮悯㤾㤿㥀㥁㥂㥃㥄㥅㥆㥇㥈㥉㥊㥋㥌㥍㥎㥏㥐㥑㥒㥓㥔㥕㥖㥗㥘㥙悰悱悲悳悴悵悶悷悸悹悺悻悼悽悾悿惀惁惂惃惄情惆惇惈惉惊惋惌惍惎惏惐惑惒惓惔惕惖惗惘惙惚惛惜惝惞惟惠惡惢惣惤惥惦惧惨惩惪惫惬惭惮惯惡㥚㥛㥜㥝㥞㥟㥠㥡㥢㥣㥤㥥㥦㥧㥨㥩㥪㥫惰惱惲想惴惵惶惷惸惹惺惻惼惽惾惿愀愁愂愃愄愅愆愇愈愉愊愋愌愍愎意愐愑愒愓愔愕愖愗愘愙愚愛愜愝愞感愠愡愢愣愤愥愦慨㥬㥭㥮㥯㥰㥱㥲㥳㥴㥵㥶㥷㥸㥹㥺㥻愧愨愩愪愫愬愭愮愯愰愱愲愳愴愵愶愷愸愹愺愻愼愽愾愿慀慁慂慃慄慅慆慇慈慉慊態慌慍慎慏慐慑慄㥼㥽㥾㥿㦀㦁㦂㦃㦄㦅㦆㦇㦈慒慓慔慕慖慗慘慙慚慛慜慝慞慟慠慡慢慣慤慥慦慧慩慪慫慬慮慯慰慱慲慳慴慵慶慷慸慹慺慻慼慽慾慿憀憁憂憃憄憅憆憇憈㦉㦊㦋㦌㦍㦎㦏㦐㦑㦒㦓㦔㦕㦖慭憉憊憋憌憍憎憏憐憑憒憓憔憕憖憗憘憙憚憛憜憝憞憟憠憡憢憣憤憥憦憧憨憩憪憫憬憭憮憯憰憱憲憳憐㦗㦘㦙憴憵憶憷憸憹憺憼憽憾憿懀懁懂懃懄懅懆懇懈應懊懋懌懍懎懏懐懑懒懓懔㦚㦛㦜㦝㦞㦟㦠憻懕懖懗懘懙懚懛懜懝懞懟懠懡懢懣懤懥懦懧懨㦡㦢懩懪懫懬懭懮懯懰懱懲懳懴㦣㦤㦥㦦㦧懵懶懷懸懶㦨㦩㦪懹懺懻懼懽懾懿㦫㦬戀戁戂戀戃戄戅戆㦭戇" },
{ 62, "戈", "戈戉戊戋戌戍戎戏㦮㦯成我戒戓㦰㦱㦲戔戕或戗㦳战㦴㦵㦶戙㦷戚戛戜戝㦸戞戟戦㦹戠戡戢戣戤戥㦺戧戨戩截戫戬㦻㦼戭戮戯戱戮戰㦽戲戳戴戵" },
{ 63, "戶", "戶户戸戹㦾戺戻戼㦿㧀戽戾房所㧁㧂扁扂扃扄扅扆扇扈扉扊" },
{ 64, "手", "手扌才扎㧃㧄㧅扐扑扒打扔払扖㧆㧇㧈扏扗托扙扚扛扜扝扞扠扡扢扣扤扥扦执扨扩扪扫扬㧉㧊㧋㧌㧍㧎㧏㧐㧑扟扭扮扯扰扱扲扳扴扵扶扷批扺扻扼扽找承技抁抂抃抄抅抆抇抈抉把抌抍抎抏抐抑抒抓抔投抖抗折抙抚抛抜抝択抟抠抡抢抣护报㧒㧓㧔㧕㧖㧗㧘㧙㧚㧛㧜㧝㧞㧟㧠扸抋抦抧抨抩抪披抬抭抮抯抰抱抳抴抵抶抷抸抹抺抻押抽抾抿拀拁拂拃拄担拆拇拈拉拊拋拌拍拎拏拐拑拒拓拔拕拖拗拘拙拚招拜拝拞拟拠拡拢拣拤拥拦拧拨择拉拏拓㧡㧢㧣㧤㧥㧦㧧㧨㧩㧪㧫㧬㧭㧮㧯㧰㧱拪拫括拭拮拯拰拱拲拳拴拵拶拷拸拹拺拻拼拽拾拿挀持挂挃挄挅挆指挈按挊挋挌挍挎挏挐挑挒挓挔挕挖挗挘挙挚挛挜挝挞挟挠挡挢挣挤挥挦挧拾㧲㧳㧴㧵㧶㧷㧸挨挩挪挫挬挭挮振挰挱挲挳挴挵挶挷挸挹挺挻挼挽挾挿捀捁捂捃捄捅捆捇捈捉捊捋捌捍捎捏捐捑捒捓捔捕捖捗捘捙捚捛捜捝捞损捠捡换捣捤㧹㧺㧻㧼㧽㧾㧿㨀㨁㨂㨃㨄㨅㨆㨇㨈捥捦捧捨捩捪捫捬捭据捯捰捱捲捳捴捵捶捷捸捹捺捻捼捽捾捿掀掁掂掃掄掅掆掇授掉掊掋掌掍掎掏掐掑排掓掔掕掖掗掘掙掚掛掜掝掞掟掠採探掣掤接掦控推掩措掫掬掭掮掯掰掱掳掴掵掶掷掸掹掺掻掼掽掠捻㨉㨊㨋㨌㨍㨎㨏㨐㨑㨒㨓㨔㨕㨖㨗㨘掲掾掿揀揁揂揃揄揆揇揈揉揊揋揌揍揎描提揑插揓揔揕揖揗揘揙揚換揜揝揞揟揠握揢揣揤揥揦揧揨揩揪揫揬揭揮揯揰揱揲揳援揵揶揷揸揹揺揻揼揽揾揿搀搁搂搃搄搅㨙㨚㨛㨜㨝㨞㨟㨠㨡㨢㨣㨤㨥㨦㨧㨨㨩㨪㨫㨬搆搇搈搉搊搋搌損搎搏搐搑搒搓搔搕搖搗搘搙搚搛搜搝搞搟搠搡搢搣搤搥搦搧搨搩搪搫搬搭搮搯搰搲搳搴搵搶搷搸搹携搻搼搽搾搿摀摁摂摃摄摅摆摇摈摉摊㨭㨮㨯㨰㨱㨲㨳㨴㨵㨶㨷㨸㨹㨺㨻㨼㨽㨾㨿㩀㩁㩂抲揅摋摌摍摎摏摐摑摒摓摔摕摗摘摙摚摛摜摝摞摟摠摡摢摣摤摥摦摧摨摩摪摫摬摭摮摯摰摱摲摳摴摵摶摷摸摹摺摻摼摽摾摿撀撁撂撃撄㩃㩄㩅㩆㩇㩈㩉㩊㩋㩌㩍㩎㩏㩐㩑搱摖撅撆撇撈撉撊撋撌撍撎撏撐撑撒撓撔撕撖撗撘撙撚撛撜撝撞撟撠撡撢撣撤撥撦撧撨撩撪撫撬播撮撯撰撱撲撳撴撵撶撷撸撹撺擆撚㩒㩓㩔㩕㩖㩗㩘㩙撻撼撽撾撿擀擁擂擃擄擅擇擈擉擊擋擌操擎擏擐擑擒擓擔擕擖擗擘擙據擛擜擝擞擄㩚㩛㩜㩝㩞㩟擟擠擡擢擣擤擦擧擨擩擪擫擬擭擮擯擰擱㩠㩡㩢㩣㩤㩥㩦㩧㩨㩩㩪㩫擥擲擳擴擵擶擷擸擹擺擻擼擽擾擿攀攁攂攃攄攅攆㩬㩭攇攈攉攊攋攌攍攎攏攐攒㩮㩯㩰攑攓攔攕攖攗攘攙攚㩱㩲㩳㩴攛攜攝攞攟攠攡攢攣攤攦攧㩵㩶㩷攥攨攩攪攫攬攭㩸㩹攮" },
{ 65, "支", "支攰㩺攱㩻㩼㩽㩾攲攳" },
{ 66, "攴", "攴攵收攷㩿㪀攸改攺攻攼㪁㪂攽放政㪃㪄㪅㪆敀敁敂敃敄故㪇㪈㪉敆敇效敉敊敋敌㪊㪋㪌㪍㪎啟敍敎敏敐救敒敓敔敕敖敗敘教敚敛敏㪏㪐㪑㪒㪓㪔㪕㪖㪗㪘㪙㪚敜敝敞敟敠敡敢散敤敥敦敧敨敩敪敭㪛㪜㪝㪞㪟敫敬敮敯数㪠㪡㪢㪣敱敲敳㪤㪥㪦整敵敶敷數敹敺敻數㪧㪨㪩㪪敼敽敾敿斀斁斂㪫㪬斃贁斄㪭斅斆㪮" },
{ 67, "文", "文㪯斈斉㪰斊斋斌斍斎斏斐斑㪱斒斓斔斕斖" },
{ 68, "斗", "斗㪲㪳斘㪴㪵㪶料斚料㪷斛斜㪸斝斞斟斠斡㪹斢㪺斣㪻" },
{ 79, "斤", "斤斥斦斧斨斩㪼㪽斪斫㪾㪿斬断㫀斮斯新斱㫁斲㫂斳斴斵斶斷斸" },
{ 70, "方", "方㫃㫄斺斻於㫆施斾斿旀㫅㫇㫈㫉旁旂旃旄旅旆旊㫊㫋㫌旇旈旉旋旌旍旎族㫍旐旑旒旓旔旕旖旗㫎㫏旘旙旚旛旜旝旞旟" },
{ 71, "无", "无旡既旣旤" },
{ 72, "日", "日旦旧㫐㫑旨早旪旫旬旭旮旯㫒㫓㫔㫕㫖㫗旰旱旲旳旴旵时旷旸㫘㫙旹旺旻旼旽旾旿昀昁昂昃昄昅昆昇昈昉昊昋昌昍明昏昐昑昒易昔昕昖昗昘昙易㫛㫜㫝㫞㫟㫠㫡㫢㫣㫤昚昛昜昝昞星映昡昢昣昤春昦昧昨昩昪昫昬昭昮是昰昱昲昳昴昵昶昷昸昹昺昻昼昽显昿㫥㫦㫧㫨㫩㫪㫫㫬㫭㫮晀晁時晃晄晅晆晇晈晉晊晋晌晍晎晏晐晑晒晓晔晕晖㫯㫰㫱㫲㫳㫴晗晘晙晚晛晜晝晞晟晠晡晢晣晤晥晦晧晨晩曽㫵㫶㫷㫸㫹㫺㫻㫼㫽㫾㫿㬀晪晫晬晭普景晰晱晲晳晴晵晶晷晸晹智晻晼晽晾晿暀暁暂暃暑晴㬁㬂㬃㬄㬅㬆㬇㬈㬉㬊㬋㬌暄暅暆暇暈暉暊暋暌暍暎暏暐暒暓暔暕暖暗暘暙暈㬍㬎㬏㬐暚暛暜暝暞暟暠暡暢暣暤暥暦暧暨㬑㬒㬓㬔㬕㬖暩暪暫暬暭暮暯暰暱暲暳暴暵暶暷暴㬗㬘㬙㬚㬛㬜㬝㬞㬟暸暹暺暻暼暽暾暿曀曁曂曃曄曅曆曇曈曉曊曋曌曍曆㬠㬡㬢曎曏曐曑曒曓曔曕曖曗曚㬣㬤㬥㬦㬧㬨曘曙曛曜㬩㬪曝曞曟曠曡曢㬫曣曤曥曦曧曨曩㬬㬭㬮曪曫曬曭曮㬯曯" },
{ 73, "曰", "曰曱㬰曲曳更曵更㫚曶曷書曺曹曻曼曾替最朁朂會朄朅㬱朆㬲朇" },
{ 74, "月", "月有㬳朊朋朌服朎朏朐朑㬴㬵朒朓朔朕㬶㬷朖朗朘朙朚望朗㬸朜朝朞期朠朡㬺㬻朢㬼㬽㬾膤㬿朣朤朥㭀朦朧" },
{ 75, "木", "木朩未末本札朮术朰㭁朱朲朳朴朵朶朷朸朹机朻朼朽朾朿杀杁杂权㭂㭃㭄㭅㭆杄杅杆杇杈杉杊杋杌杍李杏材村杒杓杔杕杖杗杘杙杚杛杜杝杞束杠条杢杣杤来杦杧杨杩极李㭇㭈㭉㭊㭋㭌㭍㭎㭏㭐杪杫杬杭杮杯杰東杲杳杴杵杶杷杸杹杺杻杼杽松板枀枂枃构枅枆枇枈枉枊枋枌枍枎枏析枑枒枓枔枕枖林枘枙枚枛果枝枞枟枠枡枢枣枤枥枦枧枨枩枪枫枬枭杻林㭑㭒㭓㭔㭕㭖㭗枮枯枰枱枲枳枴枵架枷枸枹枺枻枼枽枾枿柀柁柂柃柄柅柆柇柈柉柊柋柌柍柎柏某柑柒染柔柕柖柗柘柙柚柛柜柝柞柟柠柡柢柣柤查柦柧柨柩柪柫柬柭柮柯柰柱柲柳柴柵柶柷柸柹柺査柼柽柾柿栀栁栂栃栄栅栆标栈栉栊栋栌栍栎栏栐树柳㭘㭙㭚㭛㭜㭝㭞㭟㭠㭡㭢㭣㭤㭥㭦㭧栒栓栔栕栖栗栘栙栚栛栜栝栞栟栠校栢栣栤栥栦栧栨栩株栫栬栭栮栯栰栱栲栳栴栵栶样核根栺栻格栽栾栿桀桁桂桃桄桅框桇案桉桊桋桌桍桎桏桐桑桒桓桔桕桖桗桘桙桚桛桜桝桞桟桠桡桢档桤桥桦桧桨桩桪栗㭨㭩㭪㭫㭬㭭㭮㭯㭰㭱㭲㭳㭴㭵㭷桫桬桭桮桯桰桱桲桳桴桵桶桷桸桹桺桻桼桽桾桿梀梁梂梃梄梅梆梇梈梉梊梋梌梍梎梏梐梑梒梓梔梕梖梗梘梙梚梛梜條梞梟梠梡梢梣梤梥梦梧梨梩梪梫梬梭梮梯械梱梲梳梴梵梶梷梸梹梺梻梼梽梾梿检棁棂梁梨㭶㭸㭹㭺㭻㭼㭽㭾㭿㮀㮁㮂㮃㮄㮅㮆㮇㮈㮉㮊棃棄棅棆棇棈棉棊棋棌棍棎棏棐棑棒棓棔棕棖棗棘棙棚棛棜棝棞棟棠棡棢棣棤棥棦棧棨棩棪棫棬棭森棯棰棱棲棳棴棵棶棷棸棹棺棻棼棽棾棿椀椁椂椃椄椅椆椇椈椉椊椋椌植椎椏椐椑椒椓椔椕椖椗椘椙椚椛検椝椞椟椠椡椢椣椤椥椦椧椨椩椪椫椬椭椮㮋㮌㮍㮎㮏㮐㮑㮒㮓㮔㮕㮖㮗㮘㮙㮚㮛㮜㮝㮞㮟㮠㮢㮣椯椰椱椲椳椴椵椶椷椸椹椺椻椼椽椾椿楀楁楂楃楄楅楆楇楈楉楊楋楌楍楎楏楐楑楒楓楔楕楖楗楘楙楚楛楜楝楞楟楠楡楢楣楤楥楦楧楨楩楪楫楬業楮楯楰楱楲楳楴極楶楷楸楹楺楻楼楽楾楿榀榁概榃榄榅榆榇榈榉榋榌榔榘﨓㮤㮥㮦㮧㮨㮩㮪㮫㮬㮭㮮㮯㮰㮱㮲㮳㮴㮵㮶㮷㮸㮹㮺㮻㮼㮽榊榍榎榏榐榑榒榓榕榖榗榙榚榛榜榝榞榟榠榡榢榣榤榥榦榧榨榩榪榫榬榭榮榯榰榱榲榳榴榵榶榷榸榹榺榻榼榽榾榿槀槁槂槃槄槅槆槇槈槉槊構槌槍槎槏槐槑槒槓槔槕槖槗様槙槚槛槜槝槞槟槠槡槩樮欅﨔㮾㮿㯀㯁㯂㯃㯄㯅㯆㯇㯈㯉㯊㯋㯌㯍㯎㯏㯑㯒㯠槢槣槤槥槦槧槨槪槫槬槭槮槯槰槱槲槳槴槵槶槷槸槹槺槻槼槽槾槿樀樁樂樃樄樅樆樇樈樉樊樋樌樍樎樏樐樑樒樓樔樕樖樗樘標樚樛樜樝樞樟樠模樢樣樤樥樦樧樨権横樫樬樭樯樰樱橥橴樂樓樂樂㯐㯓㯔㯕㯖㯗㯘㯙㯚㯛㯜㯝㯞㯟㯡㯢㯣㯤㯥㯦㯧㯨㯩樲樳樴樵樶樷樸樹樺樻樼樽樾樿橀橁橂橃橄橅橆橇橈橉橊橋橌橍橎橏橐橑橒橓橔橕橖橗橘橙橚橛橜橝橞機橠橡橢橣橤橦橧橨橩橪橫橬橭橮橯橰橱橲橳橵橶橷橸橹橺橻橼㯪㯫㯬㯭㯮㯯㯰㯱㯲㯳㯴㯵㯶橽橾橿檀檁檂檃檄檅檆檇檈檉檊檋檌檍檎檏檐檑檒檓檔檕檖檗檘檙檚檛檜檝檞檟檠檡檢檣檤檥檦檧檨檩檪㯷㯸㯹㯺㯻㯼㯽檫檬檭檮檯檰檱檲檳檴檵檶檷檸檹檺檻檼檽檾檿櫀櫁櫂櫃櫄櫅櫆櫇櫈櫉櫊㯾㯿㰀㰁㰂㰃㰄㰅㰆㰇㰈櫋櫌櫍櫎櫏櫐櫑櫒櫓櫔櫕櫖櫗櫘櫙櫚櫛櫜櫝櫞櫟櫠櫡櫢櫣櫤櫥櫦櫫櫭櫓㰉㰊㰋㰌㰍㰎㰏㰐㰑㰒㰓㰖櫧櫨櫩櫪櫬櫮櫯櫰櫱櫲櫳櫴櫵櫶㰔㰕櫸櫹櫺櫻櫼櫽櫾櫿欀欁欂欃欄欌欄㰗㰘櫷欆欇欈欉權欋欍欎㰙㰚㰛㰜欏欐欑欒欓欔欕欖欗欘欙欚欛欜欝欞欟" },
{ 76, "欠", "欠次欢㰝㰞欤㰟㰠㰡㰢欣欥欦欧㰣㰤㰥㰦㰧㰨欨欪㰩㰪㰫㰬㰭欫欬欭欮欯欰欱㰮㰯㰰㰱欲欳欴欵欶欷欸㰲㰳㰴㰵㰶㰸欹欺欻欼欽款欿㰹㰺㰻㰼㰽㰾欩歀歁歂歃歄歅歆歇歈㰿㱀㱁歉歊歋歌歍㱂㱃歎歏歐歑歒歓㱄㱅歔歕歖歗歘歙歚㱆㱇㱈㱉歛歜歝歞歟㱊歠㱋㱌歡㱍㱎" },
{ 77, "止", "止正㱏此㱐㱑步武歧歨歩㱒㱓㱔歪歫歬歭㱕㱖歮歰歱歲歳㱗歴歵歶歷歷㱘歸" },
{ 78, "歹", "歹歺㱙死歼㱚㱛㱜㱝歽歾歿殀殁㱞㱟㱠殂殃殄殅殆殇㰷㱡殈殉殊残㱢㱣殌殍殎殏殐殑殒殓㱤㱥㱦㱧㱨㱩殔殕殖殗殘殙殚㱪㱫㱬㱭㱮殛殜㱯㱰㱱㱲殝殞殟殠殡㱳㱴殢殣殤殥殦㱵㱶㱷殧殨殩殪殫㱸殬殭殮殮殯殰殱㱹㱺殲㱻" },
{ 79, "殳", "殳㱼㱽殴段殶㱾㱿殷㲀殸殹殺殻殺㲁㲂㲃殼殽㲄殾殿毀毁毂㲅毃毄毅毆㲆㲇㲈毇毈㲉㲊毉毊" },
{ 80, "毋", "毋毌母毎每毐毑毒毓" },
{ 81, "比", "比毕㲋毖毗毘毙毚" },
{ 82, "毛", "毛㲌毜毝㲍㲎㲏㲐㲑毞毟㲒毠毡㲓毢毣毤毥毦毧毨毩毪㲔㲕㲖㲗㲘㲙㲚毫毬毭毮㲛㲜㲝㲞毯毰毱毲毳毴毵毶㲟㲠㲡㲢㲣毷毸毹毺毻毼毽㲤㲥㲦㲧㲨㲩毾毿氀氁氂㲪㲫㲬㲭㲮氃氄氅氆氇氈氉氊㲯㲰氋㲱氌氍㲲氎" },
{ 83, "氏", "氏氐民氒氓㲳" },
{ 84, "气", "气氕氖気氘氙氚㲴氛氜氝氞氟氠氡氢氣氤氥氦氧氨氩㲵氪氫氬氭氮氯氰氱氲氳㲶㲷" },
{ 85, "水", "水氵㲸氶氷永氹氺㲹㲺㲻㲼氻氼氽氾氿汀汁求汃汄汅汆汇汈汉㲽㲾㲿汊汋汌汍汎汏汐汑汒汓汔汕汖汗汘汙汚汛汜汝汞江池污汢汣汤㳀㳁㳂㳃㳄㳅㳆㳇㳈㳉㳊汥汦汧汨汩汪汫汬汭汮汯汰汱汲汳汴汵汶汷汸汹決汻汼汽汾汿沀沁沂沃沄沅沆沇沈沉沊沋沌沍沎沏沐沑沒沓沔沕沖沗沘沙沚沛沜沝沞沟沠没沢沣沤沥沦沧沨沩沪沈㳋㳌㳍㳎㳏㳐㳑㳒㳓㳔㳕沫沬沭沮沯沰沱沲河沴沵沶沷沸油沺治沼沽沾沿泀況泂泃泄泅泆泇泈泉泊泋泌泍泎泏泐泑泒泓泔法泖泗泘泙泛泜泝泞泟泠泡波泣泤泥泦泧注泩泪泫泬泭泮泯泰泱泲泳泴泶泷泸泹泺泻泼泽泾泌泥㳖㳗㳘㳙㳚㳛㳜㳝㳞㳟㳠㳡㳢㳣泚泿洀洁洂洃洄洅洆洇洈洉洊洋洌洎洏洐洑洒洓洔洕洗洘洙洚洛洜洝洞洟洠洡洢洣洤津洦洧洨洩洪洫洬洭洮洯洰洱洲洳洴洵洶洷洸洹洺活洼洽派洿浀流浂浃浄浅浆浇浈浉浊测浌浍济浏浐浑浒浓浔浕洛洞㳤㳥㳦㳧㳨㳩㳪㳫㳬㳭㳮㳯㳰㳱㳲㳳洍洖浖浗浘浙浚浛浜浝浞浟浠浡浢浣浤浥浦浧浨浩浪浫浬浭浮浯浰浱浲浳浴浵浶海浸浹浺浻浼浽浾浿涀涁涂涃涄涅涆涇消涉涊涋涌涍涎涏涐涑涒涓涔涕涖涗涘涚涛涜涝涞涟涠涡涢涣涤涥润涧涨涩浪流㳴㳵㳶㳷㳸㳹㳺㳻㳼㳽㳾㳿㴀㴁㴂㴃㴄㴅㴆㴇㴈㴉㴊㴋㴌㴍㴎涙涪涫涬涭涮涯涰涱液涳涴涵涶涷涸涹涺涻涼涽涾涿淀淁淂淃淄淅淆淇淈淉淊淋淌淍淎淏淐淑淒淓淔淕淖淗淘淙淚淛淜淝淞淟淠淡淢淣淤淥淦淧淨淩淪淫淬淭淮淯淰深淲淳淴淵淶混淸淹淺添淼淽淾淿渀渁渂渄清渆渇済渉渊渋渌渍渎渏渐渑渒渓渔渕渖渗渚湴淚淪淋㴏㴐㴑㴒㴓㴔㴕㴖㴗㴘㴙㴚㴛㴜㴝㴞㴟㴠㴡㴢㴣㴤渃渘渙減渜渝渞渟渠渡渢渣渤渥渦渧渨温渪渫測渭渮港渰渱渲渳渴渵渶渷游渹渺渻渼渽渾渿湀湁湂湃湄湅湆湇湈湉湊湋湌湍湎湏湐湑湒湓湔湕湖湗湘湙湚湛湜湝湞湟湠湡湢湣湤湥湦湧湨湩湪湫湬湭湮湯湰湱湲湳湵湶湷湸湹湺湻湼湽湾湿満溁溂溃溄溅溆溇溈溉溊溋溌滋滞㴥㴦㴧㴨㴩㴪㴫㴬㴭㴮㴯㴰㴱㴲㴳㴴㴵㴶㴷㴸㴹㴺㴻溍溎溏源溑溒溓溔溕準溗溘溙溚溛溜溝溞溟溠溡溢溣溤溥溦溧溨溩溪溫溬溭溮溯溰溱溲溳溴溵溶溷溸溹溺溻溼溽溾溿滀滁滂滃滄滅滆滇滈滉滊滍滎滏滐滑滒滓滔滕滖滗滘滙滛滜滝滟滠满滢滣滤滥滦滧滨滩滪漓滑溜溺㴼㴽㴾㴿㵀㵁㵂㵃㵄㵅㵆㵇㵈㵉滌滚滫滬滭滮滯滰滱滲滳滴滵滶滷滸滹滺滻滼滽滾滿漀漁漂漃漄漅漆漇漈漉漊漌漍漎漏漐漑漒演漕漖漗漘漙漚漛漜漝漞漟漠漡漢漣漤漥漦漧漨漩漪漫漬漭漮漯漰漱漲漳漴漵漶漷漸漹漺漻漼漾漿潀潁潂潃潄潅潆潇潈潉潊潋潌潍漏漣㵊㵋㵌㵍㵎㵏㵐㵑㵒㵓㵔㵕㵖㵗㵘㵙㵚㵛㵜漋漽潎潏潐潑潒潓潔潕潖潗潘潙潚潛潜潝潞潟潠潡潢潣潤潥潦潧潨潩潪潫潬潭潮潯潰潱潲潳潴潵潶潷潸潹潺潻潼潽潾潿澁澂澃澄澅澆澇澈澉澊澋澌澍澎澏澐澑澒澓澔澕澖澗澘澚澛澜澝濐㵝㵞㵟㵠㵡㵢㵣㵤㵥㵦㵧㵨㵩㵪㵫㵬㵭㵮澙澞澟澠澡澢澣澤澥澦澧澨澩澪澫澬澭澮澯澰澱澲澳澴澵澶澷澸澹澺澻澼澽澾澿激濁濂濃濄濅濆濇濈濉濊濋濌濍濎濏濑濒濓濖㵯㵰㵱㵲㵳㵴㵵㵶㵷㵸㵹㵺㵻㵼澀濔濕濗濘濙濚濛濜濝濞濟濠濡濢濣濤濥濦濧濨濩濪濫濬濭濮濯濰濱濲濴濵濶濷濸濫㵽㵾㵿㶀㶁㶂㶃濹濺濻濼濽濾濿瀀瀁瀂瀃瀄瀅瀆瀇瀈瀉瀊瀋瀌瀍瀎瀏瀐瀑瀒瀓瀔濾㶄㶅㶆㶇㶈㶉㶊㶋濳瀕瀖瀗瀘瀙瀚瀛瀜瀝瀞瀟瀠瀡瀢瀣瀤瀥瀦瀧瀨瀩瀪瀫瀬瀭瀮㶌㶍㶎㶏㶐㶑瀯瀰瀱瀲瀳瀴瀵瀶瀷瀸瀹瀺瀻瀼瀽瀾瀿灀灁㶒㶓㶔㶕㶖㶗㶘灂灃灄灅灆灇灈灉灊灋灌灍灏灐㶙㶚灑灒灓灔灕灖灗灘㶛㶜㶝灙灚灛灜㶞㶟灝灞灟灠灡灢灣㶠灎灤灥灦灧灨灩灪" },
{ 86, "火", "火灬灭㶡㶢灮灯灰灱灲灳炇㶣㶤㶥灴灵灶灷灸灹灺灻灼災灾灿炀㶦㶧㶨㶩㶪炁炂炃炄炅炆炈炉炊炋炌炍炎炏炐炑炒炓炔炕炖炗炘炙炚炛炜炝炞炙㶫㶬㶭㶮㶯㶰㶱㶲炟炠炡炢炣炤炥炦炧炨炩炪炫炬炭炮炯炰炱炲炳炴炵炶炷炸点為炻炼炽炾炿烀烁烂烃㶳㶴㶵㶶㶷㶸烄烅烆烇烈烉烊烋烌烍烎烏烐烑烒烓烔烕烖烗烘烙烚烛烜烝烞烟烠烡烢烣烤烥烦烧烨烩烪烫烬热烮烙烈㶹㶺㶻㶼㶽㶾㶿㷀㷁烯烰烱烲烳烴烵烶烷烸烹烺烻烼烽烾烿焀焁焂焃焄焅焆焇焈焉焊焋焌焍焎焏焐焑焒焓焕焖焗焘㷂㷃㷄㷅㷆㷇㷈㷉㷊㷋㷌㷍焔焙焚焛焜焝焞焟焠無焢焣焤焥焦焧焨焩焪焫焬焭焮焯焰焱焲焳焴焵然焷焸焹焺焻焼焽焾焿煀煮㮡㷎㷏㷐㷑㷒㷓㷔㷕㷖㷗㷘㷙㷚㷛㷜㷝㷞煁煂煃煄煅煆煇煈煉煊煋煌煍煎煏煐煑煒煓煔煕煖煗煘煙煚煛煜煝煞煟煠煡煢煣煤煥煦照煨煩煪煫煬煭煯煰煱煲煳煴煵煶煷煸煺煉㷟㷠㷡㷢㷣㷤㷥㷦㷧㷨㷩㷪煹煻煼煽煾煿熀熁熂熃熄熅熆熇熈熉熊熋熌熍熎熏熐熑熒熓熔熕熖熗熘熙熦㷫㷬㷭㷮㷯㷰㷱㷲熚熛熜熝熞熟熠熡熢熣熤熥熧熨熩熪熫熬熭熮熯熰熱熲熳熴熵㷳㷴㷵㷶㷷㷸㷹㷺㷻㷼㷽熶熷熸熹熺熻熼熽熾熿燀燁燂燃燄燅燆燇燈燉燊燋燌燍燎燏燐燑燒燓燔燕燖燗燘燙燚燛燜燝燞燎燐㷾㷿㸀㸁㸂㸃營燠燡燢燣燤燥燦燧燨燩燪燫燬燭燮燯燰燱燲燳燴燵燶燷㸄㸅燸燹燺燻燼燽燾燿爀爁爂爃㸆㸇㸉爄爅爆爇爈爉爊爌爍爎爕㸈㸊㸋㸌爋爏爐爑爒爓爔爖爗爘爐㸍爙爚爛爛㸎爜爝爞爟爠㸏㸐爡爢爤爥爦㸑爧爨爩" },
{ 87, "爪", "爪爫㸒㸓爬爭爮爯爰爱㸔爲㸕爳噕爴爵" },
{ 88, "父", "父爷爸㸖㸗爹㸘㸙爺" },
{ 89, "爻", "爻㸚爼爽爾" },
{ 90, "爿", "丬爿牀㸛牁牂㸜牃牄牅牆" },
{ 91, "片", "片㸝㸞版牉牊㸟㸠㸡牋牌牍牎牏牐牑牒㸢牓牔牕牖牗㸣㸤牘㸥" },
{ 92, "牙", "㸦牙㸧牚" },
{ 93, "牛", "牛牜㸨牝牞牟㸩㸪牠牡牢牣牤牢㸫㸬㸭㸮㸯牥牦牧牨物牪牫牬㸰㸱㸲㸳㸴牭牮牯牰牱牲牳牴牵㸵㸶㸷㸸牶牷牸特牺㸹㸺㸻㸼㸽㸾㸿㹀牻牼牽牾牿犁㹁㹂㹃犀犂犃犄犅犆犇犈犉犊犋㹅㹆㹇㹈犌犍犎犏犐犑㹄㹉㹊㹋犒犓犔犕犖犗㹌㹍㹎㹏㹐犘犙犚犛㹑㹒㹓犜犝犞犟㹔㹕㹖犠㹗㹘㹙犡犢犣犤犥犦犧犨㹚㹛犩犪犫" },
{ 94, "犬", "犬犭犮犯犰犱犲犳犴犵状犷犸㹜㹝㹞㹟㹠犹犺犻犼犽犾犿狀狁狂狃狄狅狆狇狈狀㹡㹢㹣㹤㹥㹦㹧㹨㹩㹪狉狊狋狌狍狎狏狐狑狒狓狔狕狖狗狘狙狚狛狜狝狞㹫㹬㹭㹮㹯㹰狟狠狡狢狣狤狥狦狧狨狩狪狫独狭狮狯狰狱狲㹱㹲㹳㹴㹵㹶㹷㹸狳狴狵狶狷狸狹狺狻狼狽狾狿猀猁猂猃狼㹹㹺㹻㹼㹽㹾㹿㺀猄猅猆猇猈猉猊猋猌猍猎猏猐猑猒猓猔猕猖猗猘猙猚猛猜猝猞猟猠猡猪猪㺁㺂㺃㺄㺅㺆猢猣猤猥猦猧猨猩猫猬猭献猯猰猱猲猳猴猵猶猷猸猹獁獓㺇㺈㺉㺊㺋㺌㺍猺猻猼猽猾猿獀獂獃獄獅獆獇獈獉獊㺎㺏㺐㺑㺒㺓獌獍獎獏獐獑獒獔獕㺔㺕㺖㺗㺘㺙獋獖獗獘獙獚獛獜獝獞獟獠獡獢獣獤㺚㺛㺜獥獦獧獨獩獪獫獬獭㺝㺞㺟獮獯獰獱獲獳獴㺠獵獶獷獸獵㺡㺢獹獺獻㺣㺤㺥㺦獼獽獾獿玀玁玂玃㺧" },
{ 95, "玄", "玄玅玆率玈率率" },
{ 96, "玉", "玉玊王玌玍㺨㺩㺪㺫玎玏玐玑㺬㺭㺮㺯玒玓玔玕玖玗玘玙玚玛㺰㺱㺲㺳㺴㺵㺶玜玝玞玟玠玡玢玣玤玥玦玧玨玩玪玫玬玭玮环现玱㺷㺸㺹㺺㺻㺼㺽㺾玲玳玴玵玶玷玸玹玺玻玼玽玾玿珀珁珂珃珄珅珆珇珈珉珊珋珌珍珎珏珐珑玲㺿㻀㻁㻂㻃㻄㻅㻆㻇㻈珒珓珔珕珖珗珘珙珚珛珜珝珞珟珠珡珢珣珤珥珦珧珨珩珪珫珬班珮珯珰珱珲琉珞琉㻉㻊㻋㻌㻍㻎㻏㻐珳珴珵珶珸珹珺珻珼珽現珿琀琁琂球琄琅理琇琈琊琋琌琍琎琏琐琑琒琓理㻑㻒㻓㻔㻕㻖㻗㻘㻙㻚㻛㻜珷琔琕琖琗琘琙琚琛琜琝琟琠琡琢琣琤琥琦琧琨琩琪琫琬琭琮琯琰琱琲琳琴琵琶琷琸琹琺琻琼琢㻝㻞㻟㻠㻡㻢㻣㻤㻥㻦琞琽琾琿瑀瑁瑂瑃瑄瑅瑆瑇瑈瑉瑊瑋瑌瑍瑎瑏瑐瑑瑒瑓瑔瑕瑖瑗瑘瑙瑚瑛瑜瑝瑞瑟㻧㻨㻩㻪瑠瑡瑢瑣瑤瑥瑦瑧瑨瑩瑪瑫瑬瑭瑮瑯瑰瑱瑲瑳瑴瑵瑶瑷瑸瑩㻫㻬㻭㻮㻯㻰㻱㻲㻳㻴瑹瑺瑻瑼瑽瑾瑿璀璁璂璃璄璅璆璇璈璉璊璋璌璎璓璉㻵㻶㻷㻸㻹㻺㻻㻼璍璏璐璑璒璔璕璖璗璘璙璚璛璜璝璞璟璠璡璣璤璘㻽㻾㻿㼀㼁㼂璢璥璦璧璨璩璪璫璬璭璮璯環璱璲璳璴璵璶璷璸璹璺璻璼璽璾璿瓀瓁瓂㼃㼄㼅㼆瓃瓄瓅瓆瓇瓈瓉瓊瓋㼇瓌瓍瓎瓏瓐瓑瓒瓓瓔瓕瓖瓗瓘瓙㼈瓚瓛" },
{ 97, "瓜", "瓜瓝㼉㼊㼋㼌瓞瓟㼍㼎瓠㼏瓡㼐㼑㼒㼓㼔瓢㼕瓣瓤瓥㼖" },
{ 98, "瓦", "瓦㼗瓧㼘㼙瓨瓩㼚㼛瓪瓫瓬瓭瓮瓯瓰瓱瓲㼜㼝㼞㼟㼠瓳瓴瓵㼡㼢㼣㼤㼥㼦瓶瓷瓸㼧㼨㼩㼪瓹瓺瓻瓼㼫㼬㼭㼮㼯㼰㼱瓽瓾瓿甀甁㼲㼳㼴㼵㼶㼷甂甃甄甅甆㼸㼹㼺甇甈甉㼻㼼㼽㼾甊甋甌甍甎㼿㽀㽁㽂㽃㽄㽅甏甐甑甒㽆㽇甓甔甕㽈㽉甖甗㽊㽋㽌" },
{ 99, "甘", "甘甙甚㽍甛甜㽎甝甞㽏㽐㽑" },
{ 100, "生", "生甠甡產産㽒甤甥甦甧㽓㽔" },
{ 101, "用", "用甩甪甫甬甭甮甯" },
{ 102, "田", "田由甲申甴电甶㽕㽖㽗男甸甹町甼画甽甾甿畀畁畂畃畄畅㽘㽙㽚畆畇畈畉畊畋界畍畎畏畐畑畒畓㽛㽜畔畕畖畗畘留畚畛畜畝畞畟留㽝㽞畡畢畣畤略畦畧畩略㽟㽠番畫畬畭畮畯異畲畳畴異㽡㽢㽣㽤畵當畷畸畹畺㽥畱畻畼畽㽦㽧㽨畾畿㽩疀疁疂㽪疃疄㽫㽬疅㽭疆疇㽮疈疉疊㽯" },
{ 103, "疋", "疋疌疍疎疏㽰疐疑" },
{ 104, "疒", "疒㽱㽲疓疔疕疖疗㽳㽴㽵㽶疘疙疚疛疜疝疞疟疠㽷㽸㽹㽺㽻㽼疡疢疣疤疥疦疧疨疩疪疫疬疭疮疯疺㽽㽾㽿㾀㾁㾂㾃㾄㾅㾆㾇㾈㾉疰疱疲疳疴疵疶疷疸疹疻疼疽疾疿痀痁痂痃痄病痆症痈痉㾊㾋㾌㾍㾎㾏㾐㾑㾒痊痋痌痍痎痏痐痑痒痓痔痕痖㾓㾔㾕㾖㾗㾘㾙㾚㾛㾜㾝㾞㾟㾠㾡痗痘痙痚痛痜痝痞痟痠痡痢痣痤痥痦痧痨痩痪痫痢㾢㾣㾤㾥㾦㾧㾨㾩痬痭痮痯痰痱痲痳痴痵痶痷痸痹痺痻痼痽痾痿瘀瘁瘂瘃瘄瘅瘆㾪㾫㾬㾭㾮㾯㾰㾱㾲㾳㾴㾵瘇瘈瘉瘊瘋瘌瘍瘎瘏瘐瘑瘒瘓瘔瘕瘖瘗瘘瘧㾶㾷㾸㾹㾺㾻㾼㾽㾾㾿㿀㿁瘙瘚瘛瘜瘝瘞瘟瘠瘡瘢瘣瘤瘥瘦瘨瘩瘪瘫㿂㿃㿄㿅㿆㿇㿈瘬瘭瘮瘯瘰瘱瘲瘳瘴瘵瘶瘷瘸瘹瘺瘻瘼瘽瘾瘿癊㿉㿊癀癁療癃癄癅癆癇癈癉癋癌癍癎療㿋㿌㿍㿎㿏㿐癏癐癑癒癓癔癕癖癗癘癙癚癛癜癝癞㿑㿒㿓癟癠癡癣㿔癢癤癥癦㿕㿖㿗癧癨癩癪癫癩㿘癬癭癮㿙癯癰㿚㿛癱癲癳㿜癴癵" },
{ 105, "癶", "癶癷癸癹発登發" },
{ 106, "白", "白百癿㿝皀皁皂皃的㿞皅皆皇皈㿟畠皉皊皋皌皍㿠㿡皎皏皐皑皒皓皔皕皖㿢皗皘皙㿣㿤㿥皚皛皜皝皞㿦皟皠皡皢皣皤皥皦皧皨㿧皩皪皫㿨皬皭㿩" },
{ 107, "皮", "皮㿪皯㿫㿬㿭㿮皰皱㿯㿰皲㿱皳皴㿲㿳皵㿴㿵皶皷皸皹㿶㿷皺㿸皻皼㿹皽㿺皾" },
{ 108, "皿", "皿盀盁㿻盂㿼㿽盃盄盅盆盇盈㿾㿿䀀盉益盋盌盍盎盏盐监益䀁䀂盒盓盔盕盖盗盘䀃盙盚盛盜䀄䀅盝盞盟䀆盠盡盢監盤䀇䀈盥盦盧盧䀉盨盩盪盫盬䀊盭䀋䀌䀍" },
{ 109, "目", "目䀎䀏盯䀐䀑䀒䀓䀔盰盱盲盳直盵䀕䀖䀗䀘䀙䀚䀛䀜䀝䀞盶盷相盹盺盻盼盽盾盿眀省眂眃眄眅眆眇眈眉眊看県眍省䀟䀠䀡䀢䀣䀤䀥䀦眎眏眐眑眒眓眔眕眖眗眘眙眚眛眜眝眞真眠眡眢眣眤眥眦眧眨眩眪眫眬眿䀧䀨䀩䀪䀫䀬䀭䀮眭眮眯眰眱眲眳眴眵眶眷眸眹眺眻眼眽眾睁䀯䀰䀱䀲䀳䀴䀵䀶䀷䀸䀹䀺䀻䀼䀽䀾䀿䁀睂睃睄睅睆睇睈睉睊睋睌睍睎睏睐睑䁁䁂䁃䁄䁅䁆䁇䁈䁉睒睓睔睕睖睗睘睙睚睛睜睝睞睟睠睡睢督睤睥睦睧睨睩睪睫睬睭䁊䁋䁌䁍䁎䁏䁐䁑䁒䁓䁔䁕䁖睮睯睰睱睲睳睴睵睶睸睹睺睻睼睽睾睿瞀瞁瞂瞃瞄瞅瞆䁗䁘䁙䁚䁛䁜䁝䁞䁟䁠䁡瞇瞈瞉瞊瞋瞌瞍瞎瞏瞐瞑瞒瞓䁢䁣䁤䁥䁦䁧䁨䁩䁪瞔瞕瞖瞗瞘瞙瞚瞛瞜瞝瞞瞟瞠瞡瞢瞣䁫䁬䁭䁮䁯䁰䁱䁲䁳瞤瞥瞦瞧瞨瞩瞪瞫瞬瞭瞮瞯瞰瞱瞲瞳瞴瞵瞶瞷䁴䁵䁶䁷䁸䁹䁺瞸瞹瞺瞻瞼瞽瞾瞿矀矁矂矃矄矅矆矇矈矉矊䁻䁼䁽䁾矋矌矍矎矏䁿䂀矐矑矒矓䂁䂂䂃矔睷矕矗䂄矘矙矖矚䂅" },
{ 110, "矛", "矛䂆䂇矜矝䂈矞矟矠䂉䂊䂋䂌䂍䂎矡" },
{ 111, "矢", "矢矣矤知矦矧矨䂏䂐䂑矩䂒矪矫䂓矬短䂔矮䂕矯矰矱矲" },
{ 112, "石", "石䂖䂗矴矵矶䂘䂙矷矸矹矺矻矼矽矾矿砀码䂚䂛䂜䂝䂞泵砂砃砄砅砆砇砈砉砊砋砌砍砎砏砐砑砒砓砕砖砗砘砙砚砛砜䂟䂠䂡䂢䂣䂤䂥䂦䂧䂨砝砞砟砠砡砢砣砤砥砦砧砨砩砪砫砬砭砮砯砰砱砲砳破砵砶砷砸砹砺砻砼砽砾砿础硁䂩䂪䂫䂬䂭䂮䂯研硂硃硄硅硆硇硈硉硊硋硌硍硎硏硐硑硒硓硔硕硖硗硘硙硚硛䂰䂱䂲䂳䂴䂵䂶硜硝硞硟硠硡硢硣硤硥硦硧硨硩硪硫硬硭确硯硰硱硲硳硴硵硶硷硫䂷䂸䂹䂺䂻䂼䂽䂾䂿䃀䃁䃂䃃䃄䃅䃆䃇硸硹硺硻硼硽硿碀碁碂碃碄碅碆碇碈碉碊碋碌碍碎碏碐碑碒碓碔碕碖碗碘碙碚碛碜碌䃈䃉䃊䃋䃌䃍䃎䃏䃐硾碝碞碟碠碡碢碣碤碥碦碧碨碩碪碫碬碭碮碯碰碱碲碳碴碵碶碷碸碹磁䃑䃒䃓䃔䃕䃖䃗確碻碼碽碾碿磀磂磃磄磅磆磇磈磉磊磋磌磍磎磏磐磑磒磓磔磕磖磗磘磙磜磤磊䃘䃙䃚䃛䃜䃝䃞䃠磚磛磝磞磟磠磡磢磣磥磦磧磨磩磪磫磬磭磮䃟䃡䃢䃣䃤䃥䃦䃧䃨磯磰磱磲磳磴磵磶磷磸磹磺磻磼磽磾磿礀礁礂礃礄礅磻䃩䃪䃫䃬䃭䃮䃯礆礇礈礉礊礋礌礍礎礏礐礑礒礓礔礕礖䃰礗礘礙礚礛礜礝礞礟礠礡䃱䃲䃳礢礣礤礥礦礧礨礩礪礫礬礪䃴䃵䃶䃷礭礮礯礰礱礲礳礴䃸䃹礵礶礷䃺礸礹䃻" },
{ 113, "示", "示礻礼礼䃼礽社礿祀祁祂祃䃽䃾䃿䄀祄祅祆祇祈祉祊祋祌祍祎视䄁䄂䄃祏祐祑祒祓祔祕祖祗祘祙祚祛祜祝神祟祠祡祢神䄄䄅䄆祣祤祥祧票祩祪祫祬祭祮祯祥䄇䄈䄉䄊祦祰祱祲祳祴祵祶祷祸禄䄋䄌䄍䄎䄏䄐䄑䄒祹祺祻祼祽祾祿禀禁禂禃禅禆祿䄓䄔䄕䄖䄗禇禈禉禊禋禌禍禎福禐禑禒禓禔禕禖禗禘禙福䄘䄙禚禛禜禝禞禟禠禡禢禣䄚䄛䄜䄝䄞禤禥禦䄟禧禨禩禪禫䄠䄡禬禭禮禯禮䄢禰禱䄣禲䄤禳禴禵禶禷䄥" },
{ 114, "禸", "禸禹禺离禼禽" },
{ 115, "禾", "禾䄦䄧禿秀私秂秃䄨䄩䄪䄫䄬䄭秄秅秆秇秈秉秊䄮䄯䄰䄱䄲䄳䄴䄵秋秌种秎秏秐科秒秓秔秕秖秗䄶䄷䄸䄹秘秙秚秛秜秝秞租秠秡秢秣秤秥秦秧秨秩秪秫秬秭秮积称䄺䄻䄼䄽䄾䄿䅀䅁䅂䅃䅄䅅䅆䅇䅈䅉䅊秱秲秳秴秵秶秷秸秹秺移秼秽秾稆䅋䅌䅍䅎䅏䅐䅑䅒䅓秿稀稁稂稃稄稅稇稈稉稊程稌稍税䅔䅕䅖䅗䅘䅙䅚䅛䅜䅝䅞䅟稏稐稑稒稓稔稕稖稗稘稙稚稛稜稝稞稟稠稡稢稣稤稥稜䅠䅡䅢䅣䅤䅥䅦䅧䅨䅩䅪䅫稦稧稨稩稪稫稬稭種稯稰稱稲稳䅬䅭䅮䅯䅰䅱䅲䅳䅴䅵䅶稴稵稶稷稸稹稺稻稼稽稾稿穀穁穂穃䅷䅸䅹䅺䅻䅼䅽穄穅穆穇穈穊穋穌積穎穏穐穑穒䅾䅿䆀穉穓穔穕穖穗穘穙穚穛穜穝穞䆁䆂䆃䆄䆅䆆䆇穟穠穡穢穣穤穥穦穧穨穩穪穫䆈䆉穬穭穮穯䆊䆋䆌䆍䆎䆏穰穳穱穲䆐" },
{ 116, "穴", "穴穵䆑究穷䆒穸穹空穻䆓䆔䆕䆖穼穽穾穿窀突窂窃䆗䆘䆙窄窅窆窇窈窉窊窋窌窍窎䆚䆛䆜䆝䆞䆟䆠窏窐窑窒窓窔窕䆡䆢䆣䆤䆥窖窗窘窙窚窛窜窝䆦䆧䆨䆩窞窟窠窡窢窣窤窥窦窧䆪䆫窨窩窪窫窬窭䆬䆭䆮窮窯窰窱窲窳窴䆯䆰䆱䆲䆳䆴窵窶窷窸窹窺窻窼窽䆵䆶䆷䆸䆹䆺䆻窾窿竀竁竂䆼䆽竄竅䆾䆿竆䇀竇竃竈竉䇁竊" },
{ 117, "立", "立䇂竌竍䇃䇄竎竏䇅䇆竐竑竒竓竔竕竖竗䇇䇈䇉䇊竘站竚竛竜竝竞䇋竟章竡䇌䇍竢竣竤童竦竧䇎䇏䇐䇑竨竩竪竫竬竭端竰䇒竮竱䇓竲竳竴䇔竵䇕競竷竸竲" },
{ 118, "竹", "竹竺竻䇖竼竽竾竿笀笁笂笃䇗䇘䇙䇚䇛䇜䇝笅笆笇笈笉笊笋笌笍笎笏笐笑笒笓笔笕䇞䇟䇠䇡䇢䇣䇤䇥䇦笖笗笘笙笚笛笜笝笞笟笠笡笢笣笤笥符笧笨笩笪笫第笭笮笯笰笱笲笳笴笵笶笷笸笹笺笻笼笽笾笠䇧䇨䇩䇪䇫䇬䇭䇮䇯䇰䇱䇲䇳䇴笄笿筀筁筂筃筄筅筆筇筈等筊筋筌筍筎筏筐筑筒筓答筕策筗筘筙筚筛筜筝䇵䇶䇷䇸䇹䇺䇻䇼䇽䇾䇿䈀筞筟筠筡筢筣筤筥筦筧筨筩筪筫筬筭筮筯筰筱筲筳筴筵筶筷筸筹筺筻筼筽签筿简節䈁䈂䈃䈄䈅䈆䈇䈈䈉䈊䈋䈌䈍箁箂箃箄箅箆箇箈箉箊箋箌箍箎箏箐箑箒箓箔箕箖算箘箙箚箛箜箝箞箟箠管箢箣箤箥箦箧箨箩箪箫䈎䈏䈐䈑䈒䈓䈔䈕䈖䈗䈘䈙䈚䈛䈜䈝䈞䈟䈠䈡䈢䈣䈤䈥䈦䈧䈨䈩箬箭箮箯箰箱箲箳箴箵箶箷箸箹箺箻箼箽箾箿篁篂篃範篅篆篇篈篊篋篌篍篎篏篐篑篒篓䈪䈫䈬䈭䈮䈯䈰䈱䈲䈳䈴䈵䈶䈷築篔篕篖篗篘篙篚篛篜篝篞篟篠篡篢篣篤篥篦篧篨篩篪篫篬篭篮篯簑簕䈸䈹䈺䈻䈼䈽䈾䈿䉀䉁䉂䉃䉄䉅䉆䉇篰篱篲篳篴篵篶篷篸篹篺篻篼篽篾篿簀簁簂簃簄簅簆簇簈簉簊簋簌簍簎簏簐簒簓簔簖簗䉈䉉䉊䉋䉌䉍䉎䉐䉑䉒䉓䉔䉕䉖䉗䉘䉙䉚䉣簘簙簚簛簜簝簞簟簠簡簢簣簤簥簦簧簨簩簪簫簬簭簮簯簰簱簲䉏䉛䉜䉝䉞䉟䉠䉡䉢䉤簳簴簵簶簷簸簹簺簻簼簽簾簿籀籁籂簾䉥籃籄籅籆籇籈籉籊籋籌籍籎籏籕籖䉦䉧䉨䉩䉪䉫䉬䉭籐籑籒籓籔䉮䉯䉰䉱籗籘籙籚籛籜籝籞籟籠籡籠䉲䉳䉴籢籣籤籥籦籧籨䉶籪籩籫籬籭籮䉷籯籰䉸䉹籱籲" },
{ 119, "米", "米籴籵籶䉺娄籷籸籹籺类籼籽籾籿粀粁粂䉻䉼粃粄粅粆粇粈粉粊粋粌粍粎粏粐粑䉽䉾䉿䊀畨粒粓粔粕粖粗粘粙粚粛粜粝粣粒䊁䊂䊃䊄䊅䊆粞粟粠粡粢粤粥粦粧粨粩粪粫粬粭䊇䊈䊉䊊䊋䊌粮粯粰粱粲粳粴粵糀䊍䊎䊏䊐䊑䊒粶粷粸粹粺粻粼粽精粿糁精䊓䊔䊕䊖䊗䊘䊙糂糃糄糅糆糇糈糉糊糋糌糍糎䊚䊛䨀糏糐糑糒糓糔糕糖糗糘糖䊜䊝䊞䊟䊠䊡䊢糙糚糛糜糝糞糟糠糡糢糨䊣䊤䊥䊦䊧䊨䊩糣糤糥糦糧糧䊪䊫䊬糩糪糫糬糭䊭䊮糮糯糰䊯糲䊰糱糳糴䊱䊲糵䊳䊴糶糷" },
{ 120, "糸", "糸糹纟糺系䊵糼糽糾糿纠䊶䊷䊸䊹䌶紀紁紂紃約紅紆紇紈紉纡红纣纤纥约级纨纩纪纫纶䊺䊻䊼䊽䊾䊿䋀䋁䋂䋃䋄䋅䋆䋇䌸紊紋紌納紎紏紐紑紒紓純紕紖紗紘紙級紛紜紝紞紟素紡索紣紤紥紦紧纬纭纮纯纰纱纲纳纴纵纷纸纹纺纻纼纽纾索紐䋈䋉䋊䋋䋌䋍䋎䋏䋐䋑䋒䋓䋔䌷䌹紨紩紪紫紬紭紮累細紱紲紳紴紵紶紷紸紹紺紻紼紽紾紿絀絁終絃組絅絆絇絈絉絊絋経线绀绁绂练组绅细织终绉绊绋绌绍绎经绐累䋕䋖䋗䋘䋙䋚䋛䋜䋝䋞䌺䌻絍絎絏結絑絒絓絔絕絖絗絘絙絚絜絝絞絟絠絡絢絣絤絥給絧絨絩絪絫絬絭絮絯絰統絲絳絴絵絶絷绑绒结绔绕绖绗绘给绚绛络绝绞统䋟䋠䋡䋢䋣䋤䋥䋦䌼絛絸絹絺絻絼絽絾絿綀綁綂綃綄綅綆綇綈綉綊綋綌綍綎綏綐綑綒經綔綕綖綗綘継続綛緐绠绡绢绣绤绥绦继绨䋧䋨䋩䋪䋫䋬䋭䋮䋯䋰䋱䋲䌽綜綝綞綟綠綡綢綣綤綥綦綧綨綩綪綫綬維綮綯綰綱網綳綴綵綶綷綸綹綺綻綼綽綾綿緀緁緂緃緄緅緆緇緈緉緊緋緌緍緎総緑緒緔緕绩绪绫绬续绮绯绰绱绲绳维绵绶绷绸绹绺绻综绽绾绿缀缁綠綾䋳䋴䋵䋶䋷䋸䋹䋺䋻䋼䋽䋾䋿䌀䌁䌂䌃䌄䌾䌿緓緖緗緘緙線緛緜緝緞緟締緡緢緣緤緥緦緧編緩緪緫緬緭緮緯緰緱緲緳練緵緶緷緸緹緺緻緼緽緾緿縀縁縂縃縄縅縆縇缂缃缄缅缆缇缈缉缊缋缌缍缎缏缐缑缒缓缔缕编缗缘練䌅䌆䌇䌈䌉䌊䌋䍀縈縉縊縋縌縍縎縏縐縑縒縓縔縕縖縗縘縙縚縛縜縝縞縟縠縡縢縣縤縥縦縧縨缙缚缛缜缝缞缟缠缡缢缣缤䌌䌍䌎䌏䌐䌑䌒䌓䌔䌕縩縪縫縬縭縮縯縰縱縲縳縴縵縶縷縸縹縺縻縼總績縿繀繁繂繃繄繅繆繇繉繊繌繍缥缦缧缨缩缪缫縷䌖䌗䌘䌙䌚䌛繈繎繏繐繑繒繓織繕繖繗繘繙繚繛繜繝繞繟繠繡繢繣繤繥繧繱缬缭缮缯䌜䌝䌞䌟䌠䌡䌢䍁繋繦繨繩繪繫繬繭繮繯繰繲繳繴繵繶繷繸繹繺缰缱缲缳缴䌣䌤䌥䌦䌧繻繼繽繾繿纀纁纂纃䌨䌩纄纅纆纇纈纉纊纋續纍纎纏纐䌪䌫䌬䌭纑纒缵䌮纓纔纕纖䌯䌰䌱䌲纗䌳䌴纘纙纚纛䌵纜纝纞" },
{ 121, "缶", "缶缷䍂缸䍃缹缺缼䍄䍅䍆䍇䍈䍉缻缽䍊缾缿罀䍋䍌罁罂䍍罃罄罅罆罇罈罉罊罋罌罍罎罏䍎罐" },
{ 122, "网", "䍏网罒罓䍐䍑罔罕罖罗䍒䍓䍔罘罙罚䍕䍖䍗罛罜罝罞罟罠罡罢䍘罣䍙䍚罤罥罦䍛䍜䍝䍞罧罨罩罪罫罬罭置署䍟罯罰罱罳罴罵罶罷罸䍠䍡罹罺罻罼罹䍢罽罾罿羀羁䍣羂䍤羃羄羅羆羅䍥羇䍦羈羉" },
{ 123, "羊", "羊羋羌羍美羏羐羑䍧䍨䍩羒羓羔羖羗羘羙䍪䍫䍬䍭着羕羚羛羜羝羞羟羚䍮䍯䍰羠羡羢䍱羣群羥羦羧羨義羪䍲䍳䍴䍵䍶羫䍷羬羭羮羯羰䍸䍹羱羲䍺䍻䍼羳羴羵羶羷羸羹羺羻羼䍽" },
{ 124, "羽", "羽羾羿䍾䍿翀翁翂翃翄翅翆䎀䎁䎂䎃䎄䎅䎆翇翈翉翊翋翌翍翎翏翐翑習䎇䎈䎉䎊翓翔翕翖翗翘翙翚䎋䎌䎍䎎翛翜翝䎏䎐䎑䎒䎓翞翟翠翡翢翣翤翥翦翧翨翩翪翫翬翭䎔䎕翮翯翰翱翲翳翴翵翶䎖䎗䎘翷翸翹翺翻翼翽翾䎙翿耀䎚" },
{ 125, "老", "老耂考䎛耄者耆耇耈耉䎜䎝䎞耊耋" },
{ 126, "而", "而䎟䎠耍耎耏耐耑䎡" },
{ 127, "耒", "而䎟䎠耍耎耏耐耑䎡" },
{ 128, "耳", "耳䎲耴耵耶耷䎳䎴耸耹耺耻耼耽耾耿聀聁聂䎵䎶聃聄聅聆聇聈聉聊聋职聍聆䎷聎聏聐聑聒聓联聠䎸䎹聕聖聗聘䎺䎻䎼䎽䎾聙聚聛聜聝聞聟聡聢聣䎿䏀聤聥聦聧聨聩聪聫䏁䏂䏃聬聭䏄䏅䏆䏇聯聰聱聲聳聯䏈聮聴聵聶職聸䏉聹聺聻聼䏊聽聾聾" },
{ 129, "聿", "聿肀肁肂肃䏋肄肅肆肇肈" },
{ 130, "肉", "肉肊䏌䏍肋肌肍肎肏肋䏎䏏肐肑肒肓肔肕肖肗肘肙肚肛肜肝肞肟肠䏐䏑䏒䏓䏔䏕䏖䏗䏘䏙䏚䏛䏜䏝股肢肣肤肥肦肧肨肩肪肫肬肭肮肯肰肱育肳肴肵肶肷肸肹肺肻肼肽肾肿胀胁䏞䏟䏠䏡䏢䏣䏤䏥胂胃胄胅胆胇胈胉胊胋背胍胎胏胐胑胒胓胔胕胖胗胘胙胚胛胜胝胞胟胠胡胢胣胤胥胦胧胨胩胪胫胬脉䏦䏧䏨䏩䏪䏫䏬䏭䏮胭胮胯胰胱胲胳胴胵胶胷胸胹胺胻胼能胾胿脀脁脂脃脄脅脆脇脈脊脋脌脍脎脏脐脑脒脓脔䏯䏰䏱䏲䏳䏴䏵䏶䏷䏸䏹䏺䏻脕脖脗脘脙脚脛脜脝脞脟脠脡脢脣脤脥脦脧脨脩脪脫脬脭脮脯脰脱脲脳脴脵脶脷脸㬹䏼䏽䏾䏿䐀䐁䐂䐃䐄䐅䐆䐇䐈䐉䐊䐋䐌脹脺脻脼脽脾脿腀腁腂腃腄腅腆腇腈腉腊腋腌腍腎腏腐腑腒腓腔腕腖腗腘腙腚𦜝䐍䐎䐏䐐䐑䐒䐓䐔䐕䐖䐗䐘䐙䐚䐛幐腛腜腝腞腟腠腡腢腣腤腥腦腧腨腩腪腫腬腭腮腯腰腱腲腳腴腵腶腷腸腹腺腻腼腽腾䐜䐝䐞䐟䐠䐡䐢䐣䐤䐥䐦䐧䐨䐩䐪腿膀膁膂膃膄膅膆膇膈膉膊膋膌膍膎膏膐膑䐫䐬䐭䐮䐯䐰䐱䐲䐳䐴膒膓膔膕膖膗膘膙膚膛膜膝膞膟膠膡膢膣䐵䐶䐷䐸䐹䐺䐻䐼䐽膥膦膧膨膩膪膫膬膭膮膯膰膱膲膳膴膵膶䐾䐿䑀䑁膷膸膹膺膻膼膽膾膿臀臁臂臃臄臅臆臇臈臉臊臋臌䑂䑃䑄䑅臍臎臏臐臑臒臓䑆䑇䑈臔臕臗臘臘䑉䑊臖臙臚臛臜㔮䑋䑌䑍䑎臝䑏臞臟臠臡臢" },
{ 131, "臣", "臣臤臥䑐臦臧臨臩臨䑑" },
{ 132, "自", "自臫臬臭臮臯臰臱臲" },
{ 133, "至", "至䑒致室屋臵臶臷臸䑓臹臺臻" },
{ 134, "臼", "臼臽臾臿䑔舀舁䑕舂舃舄舅䑖與䑗興䑘舆舉舊舋" },
{ 135, "舌", "舌舍舎舏䑙䑚舐䑛舑舒舓舔舕䑜舖舗舘舙舚" },
{ 136, "舛", "舛舜舝䑝舞䑞䑟" },
{ 137, "舟", "舟䑠舠䑡䑢䑣舡舢舣舤䑤䑥舥舦舧舨舩航舫般舭舮舯舰舱䑦䑧䑨䑩舲舳舴舵舶舷舸船舺舻䑪䑫䑬䑭䑮舼舽舾舿䑯䑰艀艁艂艃艄艅艆艇艈艉䑱䑲䑳䑴䑵䑶䑷䑸艊艋艌艍䑹䑺䑻艎艏艐艑艒艓艔䑼䑽䑾艕艖艗艘艙䑿䒀䒁䒂䒃䒄䒅艚艛艜艝䒆䒇䒈艞艟艠艡艢艣艤艥䒉艦艧艨艩艪艫艬艭" },
{ 138, "艮", "艮良艰艱" },
{ 139, "色", "色䒊艳䒋艴艵䒌䒍䒎䒏艶䒐艷" },
{ 140, "艸", "䒑艸艹艺䒒䒓䒔艻艼艽艾艿芀芁节䒕䒖䒗䒘䒙芃芄芅芆芇芈芉芊芋芌芍芎芏芐芑芒芓芔芕芖芗䒚䒛䒜䒝䒞䒟䒠䒡䒢䒣䒤䒥芘芙芚芛芜芝芞芟芠芡芢芣芤芥芦芧芨芩芪芫芬芭芮芯芰花芲芳芴芵芶芷芸芹芺芻芼芽芾苀苁苂苃苄苅苆苇苈苉苊苋苌苍苎苏茾䒦䒧䒨䒩䒪䒫䒬䒭䒮䒯芿苐苑苒苓苔苕苖苗苘苙苚苛苜苝苞苟苠苡苢苣苤若苦苧苨苩苪苫苬苭苮苯苰英苲苳苴苵苶苷苸苹苺苻苼苽苾苿茀茁茂范茄茅茆茇茈茉茊茋茌茍茎茏茐茑茓茔茕若䒰䒱䒲䒳䒴䒵䒶䒷䒸䒹䒺䒻䒼䒽䒾䒿䓀䓁茒茖茗茘茙茚茛茜茞茟茠茡茢茤茥茦茧茨茩茪茫茬茭茮茯茰茱茲茳茴茵茶茷茸茹茺茻茼茽茿荀荁荂荃荄荅荆荇荈草荊荋荌荍荎荏荐荑荒荔荕荖荗荘荙荚荛荜荝荞荟荠荡荢荣荤荥荦荧荨荩荪荫荬荭荮药莽茶䓂䓃䓄䓅䓆䓇䓈䓉䓊䓋䓌䓍䓎䓏䓐䓑䓒䓓䓔䓖茝茣荰荱荲荳荴荵荶荷荸荹荺荻荼荽荾荿莀莁莂莃莄莅莆莇莈莉莊莋莌莍莎莏莐莑莒莓莔莕莖莗莘莙莚莛莜莝莞莟莠莡莢莣莤莥莦莧莨莩莪莫莬莮莯莰莱莲莳莴莵莶获莸莹莺莻莼䓕䓗䓘䓙䓚䓛䓜䓝䓞䓟䓠䓡䓢䓣䓤䓥䓦䓧䓨䓩䓪䓫䓬䓭荓莾莿菀菁菂菃菄菅菆菇菈菉菊菋菌菍菎菏菐菑菒菓菔菕菖菗菘菙菚菛菜菝菞菟菠菡菢菣菤菥菦菧菨菩菪菫菬菭菮華菰菱菲菳菴菵菶菷菸菹菺菻菼菽菾菿萀萁萂萃萄萅萆萇萈萉萊萋萌萍萎萏萐萑萒萓萔萕萖萗萘萙萚萛萜萝萞萟萠萡萢萣萤营萦萧萨著菉菱䓮䓯䓰䓱䓲䓳䓴䓵䓶䓷䓸䓹䓺䓻莭萩萪萫萬萭萮萯萰萱萲萳萴萵萶萷萸萹萺萻萼落萾萿葀葁葂葃葄葅葆葇葈葉葊葋葌葍葎葏葐葑葒葓葔葕葖葘葙葚葛葜葝葞葟葠葡葢董葤葥葦葧葨葩葪葫葬葭葮葯葰葱葲葳葴葵葶葷葸葹葺葻葼葽葾葿蒀蒁蒂蒃蒄蒅蒆蒇蒈蒉蒊蒋蒌蒍蒎蒏落葉䓼䓽䓾䓿䔀䔁䔂䔃䔄䔅䔆䔇䔈䔉䔊䔋䔌䔍蒐蒑蒒蒓蒔蒕蒖蒗蒘蒙蒚蒛蒜蒝蒞蒟蒠蒡蒢蒣蒤蒥蒦蒧蒨蒩蒪蒫蒬蒭蒮蒯蒰蒱蒲蒳蒴蒵蒶蒷蒸蒹蒺蒻蒼蒽蒾蒿蓀蓁蓂蓃蓄蓅蓆蓇蓈蓉蓊蓋蓌蓍蓎蓏蓐蓑蓒蓓蓔蓕蓖蓗蓘蓙蓚蓛蓜蓝蓞蓟蓠蓡蓢蓣蓤蓦䔎䔏䔐䔑䔒䔓䔔䔕䔖䔗䔘䔙䔚䔛䔜䔝䔞䔟䔠䔡䔢䔣䔤䔥䔦䔧䔨䔩䔪䔫䔬蓥蓧蓨蓩蓪蓫蓬蓭蓮蓯蓰蓱蓲蓳蓴蓵蓶蓷蓸蓹蓺蓻蓼蓽蓾蓿蔀蔁蔂蔃蔄蔅蔆蔇蔈蔉蔊蔋蔌蔍蔎蔏蔐蔑蔒蔓蔔蔕蔖蔗蔘蔙蔚蔛蔜蔝蔞蔟蔠蔡蔢蔣蔤蔥蔦蔧蔨蔩蔪蔫蔬蔭蔮蔯蔰蔱蔲蔳蔴蔵蔶蔷蔸蔹蔺蔻蔼蓮蓼䔭䔮䔯䔰䔱䔲䔳䔴䔵䔶䔷䔸䔹䔺䔻䔼䔽䔾䔿䕀䕁䕂䕃䕄蔽蔾蔿蕀蕁蕂蕃蕄蕅蕆蕇蕈蕉蕊蕋蕌蕍蕎蕏蕐蕑蕒蕓蕔蕕蕖蕗蕘蕙蕚蕛蕜蕝蕞蕟蕠蕡蕢蕣蕤蕥蕦蕧蕨蕩蕪蕫蕬蕭蕮蕯蕰蕱蕲蕳蕴蕵䕅䕆䕇䕈䕉䕊䕋䕌䕍䕎䕏䕐䕑蕶蕷蕸蕹蕺蕻蕼蕽蕾蕿薀薁薂薃薄薅薆薇薈薉薊薋薌薍薎薏薐薑薒薓薔薕薖薗薘薙薚薛薜薝薞薟薠薡薢薣薤薥薦薧薨薪薫薬薮﨟䕒䕓䕔䕕䕖䕗䕘䕙䕚䕛䕜䕝薩薭薯薰薱薲薳薴薵薶薷薸薹薺薻薼薽薾薿藀藁藂藃藄藅藆藇藈藉藊藋藌藍藎藏藐藑藒藓蘤藍䕞䕟䕠䕡䕢䕣䕤䕥藔藕藖藗藘藙藚藛藜藝藞藟藠藡藢藣藤藥藦藧藨藩藪藫藬藭藯藰藱藲藳藴藵䕦䕧䕨䕩䕪䕫䕬䕭䕮䕯䕰䕱䕲藮藶藷藸藹藺藻藼藽藾藿蘀蘁蘂蘃蘄蘅蘆蘇蘈蘉蘊蘋蘌蘍蘎蘏蘐蘑蘓蘔蘢蘆藺䕳䕴䕵䕶䕷蘒蘕蘖蘗蘘蘙蘚蘛蘜蘝蘞蘟蘠蘡蘣蘥蘦蘧蘨蘩蘪蘫蘬蘭蘮蘯蘰蘭蘒䕸䕹䕺蘲蘳蘴蘵蘶蘷䕻䕼䕽蘱蘸蘹蘺蘻蘼蘽蘾蘿虀虁蘿䕾虂虃虄虅䕿䖀虆虇虈虉䖁䖂䖃䖄虊䖅䖆虋虌䖇" },
{ 141, "虍", "虍䖈虎虏䖉虐䖊䖋䖌䖍虑虒虓虔䖎䖏處虖虗虘虙虚䖐䖑虛虜虝虜䖒䖓䖔䖕䖖虞號虠虡䖗虢虣䖘虤虥虦䖙虧虨䖚䖛虩䖜虪" },
{ 142, "虫", "虫䖝虬虭虮虯虰虱虲䖞䖟䖠虳虴虵虶虷虸虹虺虻虼虽虾虿蚀蚁蚂蚃䖡䖢䖣蚄蚅蚆蚇蚉蚊蚋蚌蚍蚎蚏蚐蚑蚒蚓蚔蚕蚖蚗蚘蚙蚚蚛蚜蚝蚞蚟蚠蚡蚢蚣蚤蚥蚦蚧蚨蚩蚪蚬䖤䖥䖦䖧䖨䖩䖪䖫䖬蚫蚭蚮蚯蚰蚱蚲蚳蚴蚵蚶蚷蚸蚹蚺蚻蚼蚽蚾蚿蛀蛁蛂蛃蛄蛅蛆蛇蛈蛉蛊蛋蛌蛍蛎蛏﨡䖭䖮䖯䖰䖱䖲䖳䖴䖵蚈蛐蛑蛒蛓蛔蛕蛗蛘蛙蛚蛛蛜蛝蛞蛟蛠蛡蛢蛣蛤蛥蛦蛧蛨蛩蛪蛫蛬蛭蛮蛯蛰蛱蛲蛳蛴䖶䖷䖸䖹䖺䖻䖼䖽䖾蛖蛵蛶蛷蛸蛹蛺蛻蛼蛽蛾蛿蜀蜁蜂蜃蜄蜅蜆蜇蜈蜉蜊蜋蜌蜍蜎蜏蜐蜑蜒蜓蜔蜕蜖蜗蜫蝆䖿䗀䗁䗂䗃䗄䗅䗆䗇䗈䗉䗊䗕蜘蜙蜚蜛蜜蜝蜞蜟蜠蜡蜢蜣蜤蜥蜦蜧蜨蜩蜪蜬蜭蜮蜯蜰蜱蜲蜳蜴蜵蜶蜷蜸蜹蜺蜻蜼蜽蜾蜿蝀蝁蝂蝃蝄蝅蝇蝈蝉蝊蝋䗋䗌䗍䗎䗏䗐䗑䗒䗓䗔䗖蝌蝍蝎蝏蝐蝑蝒蝓蝔蝕蝖蝗蝘蝙蝚蝛蝜蝝蝞蝟蝠蝡蝢蝣蝤蝥蝦蝧蝨蝩蝪蝫蝬蝭蝮蝯蝰蝱蝲蝳蝴蝵蝶蝷蝸蝺蝻蝼蝽蝾蝿螀蟡䗗䗘䗙䗚䗛䗜䗝䗞蝹螁螂螃螄螅螆螇螈螉螊螋螌融螎螏螐螑螒螓螔螕螖螗螘螙螚螛螜螝螞螟螠螡螢螣螤螥螦螧螨螩蟗䗟䗠䗡䗢䗣䗤䗥䗦䗧䗨䗩䗪䗫䗬䗭䗮螪螫螬螭螮螯螰螱螲螳螴螵螶螷螸螹螺螻螼螽螾螿蟀蟁蟂蟃蟄蟅蟆蟇蟈蟉蟊蟋蟌蟍蟎蟏蟐蟑螺䗯䗰䗱䗲䗳蟓蟔蟕蟖蟘蟙蟚蟛蟜蟝蟞蟟蟠蟢蟣蟤蟥蟦蟧蟨蟩蟪蟫蟬蟭蟮蟯蟰蟱蟲蟳蟴蟵蠎䗴䗵䗶䗷䗸䗹䗺䗻蟒蟶蟷蟸蟹蟺蟻蟼蟽蟾蟿蠀蠁蠂蠃蠄蠅蠆蠇蠈蠉蠊蠋蠌蠍蠏䗼䗽䗾䗿䘀䘁蠐蠑蠒蠓蠔蠕蠖蠗蠘蠙䘂䘃䘄蠚蠛蠜蠝蠞蠟蠠蠡蠢蠣蠤蠴蠟䘅䘆䘇䘈䘉蠥蠦蠧蠨蠩蠪蠫蠬䘊䘋䘌蠭蠮蠯蠰蠱蠲蠳蠵蠶蠷蠸蠹蠺䘍蠻蠼蠽蠾䘎蠿" },
{ 143, "血", "血䘏衁衂䘐衃衄䘑衅衆衇衈衉䘒䘓䘔衊衋" },
{ 144, "行", "行衍衎䘕衏衐衑衒術衔䘖衕衖街衘衙衚衛衜衝䘗䘘衞衟衠衡䘙衢" },
{ 145, "衣", "衣衤䘚䘛补䘜䘝䘞衦衧表衩衪衫衬䘟䘠䘡衭衮衯衰衱衲衳衴衵衶衷衸衹衺衻衼衽衾衿袀袁袂袃袄袅袆袇䘢䘣䘤䘥䘦䘧袈袉袊袋袌袍袎袏袐袑袒袓袔袕袖袗袘袙袚袛袜袝袞袟袠袡袢袣袤袥袦袧袨袩袪被袬袭袮袰䘨䘩䘪䘫䘬䘭䘮袯袱袲袳袴袵袶袷袸袹袺袻袼袽袾袿裀裁裂裃裄装裆裇裈裉裂䘯䘰䘱䘲裊裋裌裍裎裏裐裑裒裓裔裕裖裗裘裙裚裛補裝裞裟裠裡裢裣裤裥裏裡䘳䘴䘵䘶䘷䘸䘹䘺䘻䘼䘽䘾䘿䙀䙁䙂裧裨裩裪裫裬裭裮裯裰裱裲裳裴裵裶裷裸裹裺裻裼製裾裿褀褁褂褃褄裸䙃䙄䙅䙆䙇䙈䙉䙊䙋䙌䙍裦褅褆複褈褉褊褋褌褍褎褏褐褑褒褓褔褕褖褗褘褙褚褛褜褝䙎䙏䙐䙑䙒䙓褞褟褠褡褢褣褤褥褦褧褨褩褪褫褬褭褮褯褰褱褲褴䙔䙕䙖䙗䙘䙙䙚䙛䙜䙝褳褵褶褷褸褹褺褻褼褽褾褿襀襁襂襃襄襅襔䙞䙟䙠䙡䙢䙣襆襇襈襉襊襋襌襍襎襏襐襑襒襓襕襰䙤䙥襖襗襘襙襚襛襜襝襞襟襠襡襢䙦䙧䙨䙩襣襤襥襦襧襨襤䙪襩襪襫襬襭襮䙫襯襱襲䙬䙭襳襴襽䙮䙯襵襶襷䙰襸襹襺襻襼䙱" },
{ 146, "西", "襾西覀䙲要䙳䙴覂䙵䙶覃覄覅覆覇覈覉覊" },
{ 147, "見", "見见覌覙观䙷䙸覍覎觃䙹䙺䙻規覐覑覒覓覔視规觅䙼䙽䙾䙿覕覗覘覚觇览觉䚀䚁覛覜觊䚂䚃覝覞覟覠覡觋䚄䚅覢覣覤覥觌觍䚆䚇䚈䚉覦覧覨覩親觎䚊䚋䚌覫覬覭覮覯觏䚍䚎覰覱覲観觐觑䚏䚐䚑䚒䚓覴覵覶覷覸覹覺覻䚔覼覽覾覿觀䚕䚖" },
{ 148, "角", "角觓觔䚗觕觖觗觘觙觚觛觝觞䚘䚙䚚觜觟觠觡觢解觤觥触觧䚛觨觩觪觫䚜䚝䚞䚟䚠觬觭觮觯䚡䚢䚣䚤觰觱䚥䚦觲觳䚧觴鵤䚨䚩䚬觵觶䚪䚫觷觸觹觺觻觼觽觾䚭觿" },
{ 149, "言", "言訁讠䚮䚯䚰訂訃訄訅訆訇計计订讣认讥䚱䚲訉訊訋訌訍討訏訐訑訒訓訔訕訖託記訙訚讦讧讨让讪讫讬训议讯记讱䚳䚴䚵䚶䚷䚸䚹䚺䚻䚼䚽䚾䚿䛀䛁䛂䛃䜣訛訜訝訞訟訠訡訢訣訤訥訦訧訨訩訪訫訬設訮訯訰許訲訳讲讳讴讵讶讷许讹论讻讼讽设访诀䛄䛅䛆䛇䛈䛉䛊䛋䛌䛍䛎䛏䛐䛑䛒䛓訴訵訶訷訸訹診註証訽訾訿詀詁詂詃詄詅詆詇詈詉詊詋詌詍詎詏詐詑詒詓詔評詖詗詘詙詚詛詜詝詞詟詠证诂诃评诅识诇诈诉诊诋诌词诎诏诐译诒䛔䛕䛖䛗䛘䛙䛚䛛䛜䜤詡詢詣詤詥試詧詨詩詪詫詬詭詮詯詰話該詳詴詵詶詷詸詹詺詻詼詽詾詿誀誁誂誃誄誅誆誇誈誉誊诓诔试诖诗诘诙诚诛诜话诞诟诠诡询诣诤该详诧诨诩䛝䛞䛟䛠䛡䛢䛣䛤䛥䛦䛧䛨誋誌認誎誏誐誑誒誓誔誕誖誗誘誙誚誛誜誝語誟誠誡誢誣誤誥誦誧誨誩說誫説読誮诪诫诬语诮误诰诱诲诳说诵诶說說䛩䛪䛫䛬䛭䛮䛯䛰䛱䛲䛳䛴䛵䛶䛷䛸䜥誯誰誱課誳誴誵誶誷誸誹誺誻誼誽誾調諀諁諂諃諄諅諆談諈諉諊請諌諍諎諏諐諑諒諓諔諕論諗諘諙諚諩请诸诹诺读诼诽课诿谀谁谂调谄谅谆谇谈谉谊論諒䛹䛺䛻䛼䛽諛諜諝諞諟諠諡諢諣諤諥諦諧諨諪諫諬諭諮諯諰諱諲諳諴諵諶諷諸諹諺諻諼諽諾諿謀謁謂謃谋谌谍谎谏谐谑谒谓谔谕谖谗谘谙谚谛谜谝谞諾諸䛾䛿䜀䜁䜂䜦䜧謄謅謆謇謈謉謊謋謌謍謎謏謐謑謒謓謔謕謖謗謘謙謚講謜謝謞謟謠謡謢谟谠谡谢谣谤谥谦谧䜃䜄䜅䜆䜇䜈䜉䜊䜨謣謤謥謦謧謨謩謪謫謬謭謮謯謰謱謲謳謴謵謶謷謸謹謺謻謼謽謾谨谩谪谫谬䜋䜌䜍䜎䜏䜐䜑謿譀譁譂譃譄譅譆譇譈證譊譋譌譎譏譐譑譒譓譔譕譖譗識譙譚譛譜谭谮谯谰谱谲識䜒䜓䜔䜕䜖䜗䜘譍譝譞譟譠譡譢譣譤譥警譧譨譩譪譫譬譭譮譯議譱譲谳谴谵䜙䜚䜛䜜䜝䜞譳譴譵譶護譸譹譺譻譼譽䜟䜠䜡譾譿讀讁讂讃讄讅讀䜢䜩讆讇讈讉變讋讌讍讎讏讐讑讒讓讔讕讖谶讗讘讙讚讛讜讝讞讟" },
{ 150, "谷", "谷䜪䜫谸谹谺谻䜬䜭谼䜮谽䜯谾䜰谿豀豁䜱豂豃䜲豄豅" },
{ 151, "豆", "豆䜳豇豈豈䜴豉䜵䜶豊豋䜷䜸䜹䜺豌豍豎䜻䜼䜽䜾䜿䝀䝁䝂豏豐豑䝃䝄豒豓豔" },
{ 152, "豕", "豕豖䝅豗䝆䝇豘豙豚豛豜豝䝈豞豟豠象䝉豢豣豤豥豦豧豨豩豪䝊䝋䝌䝍䝎豫豬豭豮豯豰豱豲豳䝏豴豵䝐䝑豷豶䝒䝓䝔䝕" },
{ 153, "豸", "豸豹豺豻䝖䝗䝘䝙豼豽䝚䝛豾豿貀貁貂貃貄貅貆貇貈貉貊䝜貋貌貍䝝䝞貎貏䝟貐貑貒貓䝠貔貕貖䝡䝢貗貘貙䝣䝤䝥䝦貚貛貜" },
{ 154, "貝", "貝贝貞貟負贞负贠財貢貣貤贡财䝧䝨貥貦貧貨販貪貫責貭貮责贤败账货质贩贪贫贬购贮贯䝩䝪䝫䝬䝭䝮䝯貯貰貱貲貳貴貵貶買貸貹貺費貼貽貾貿賀賁贰贱贲贳贴贵贶贷贸费贺贻䝰䝱䝲䞌賂賃賄賅賆資賈賉賊賋賌賍賎贼贽贾贿赀赁赂赃资赅赆賈賂㕢䝳䝴䝵賏賐賑賒賓賔賕賖賗賘赇赈赉赊䝶䝷䝸䝹䝺䝻䝼䝽䝾䝿䞍䞎賙賚賛賜賝賞賟賠賡賢賣賤賥賦賧賨賩質賫賬赋赌赍赎赏赐赑赒赓赔赕䞀䞁䞂䞃䞄䞏䞐賭賮賯賰賱賲賳賴賵赖赗䞅䞆賶賷賸賹賺賻購賽赘赙赚赛䞇賾賿贀贂贃贄贅赜䞈贆贇贈贉贊贋贌赝赞赟赠䞉贍贎贏赡赢贐贑贒贓贔䞊贕贖贗贘䞋贙贚贛赣贜贕" },
{ 155, "赤", "赤䞑赥赦赧䞒赨赩赪䞓䞔赫赬赭赮赯䞕" },
{ 156, "走", "走赱赲赳赴赵䞖䞗䞘赶起赸䞙䞚䞛䞜赹赺赻赼赽赾赿﨣䞝䞞䞟䞠䞡䞢䞣䞤趀趁趂趃趄超趆趇趈趉越趋䞥䞦䞧䞨䞩䞪趌趍趎趏趐趑趒趓趔䞫䞬䞭䞮䞯䞰䞱䞲趕趖趗趘趙趚䞳䞴䞵䞶䞷䞸趛趜趝趞趟趠趡趢趣趤䞹䞺䞻䞼趥趦趧䞽䞾䞿䟀趨䟁䟂䟃䟄䟅䟆䟇趩趪趫趬趭䟈䟉䟊䟋趮䟌趯趰䟍䟎䟏䟐趱䟑䟒趲" },
{ 157, "足", "足䟓䟔趴䟕䟖趵趶趷趸䟗䟘䟙䟚䟛䟜䟝䟞趹趺趻趽趾趿跀跁跂跃跄䟟䟠䟡䟢䟣䟤䟥䟦䟧䟨䟩䟪䟫䟬䟭跅跆跇跈跉跊跋跌跍跎跏跐跑跒跓跔跕跖跗跘跙跚跛跜距跞践䟮䟯䟰䟱䟲䟳趼跟跠跡跢跣跤跥跦跧跨跩跪跫跬跭跮路跰跱跲跳跴跶跷跸跹跺跻路䟴䟵䟶䟷䟸䟹䟺䟻䟽跼跽跾跿踀踁踂踃踄踅踆踇踈踉踊踋踌踍踎䟼䟾䟿䠀䠁䠂䠃䠄䠅䠆䠇䠈䠉䠊䠋䠌踏踐踑踒踓踔踕踖踗踘踙踚踛踜踝踞踟踠踡踢踣踤踥踦踧踨踩踪踬踭踮踯踺䠍䠎䠏䠐䠑䠒䠓䠔䠕䠖踫踰踱踲踳踴踵踶踷踸踹踻踼踽踾踿蹀蹁蹂蹃蹄蹅䠗䠘䠙䠚䠛䠜䠝蹆蹇蹈蹉蹊蹋蹌蹍蹎蹏蹐蹑蹒蹓䠞䠟䠠䠡䠢蹔蹕蹖蹗蹘蹙蹚蹛蹜蹝蹞蹟蹠蹡蹢蹣蹤蹥蹦蹧蹮躀䠣䠤䠥䠦䠧蹨蹩蹪蹫蹬蹭蹯蹰蹱蹲蹳蹴蹵蹶蹷蹸蹹蹺蹻蹼蹽蹾蹿䠨䠩躁躂躃躄躅躆躇躈躉䠪䠫躊躋躌躍躎躏䠬躐躑躒躓躔躕躖䠭䠮躗躘躙躚躛躜䠯躝躞躟躠䠰躡躢躣躤躥躦躧躩躪䠱躨" },
{ 158, "身", "身躬躭躮躯䠲䠳䠴䠵䠶躰䠷䠸䠹䠺躱躲躳躴躵䠻躶躷躸躹躺躻躼䠼躽躾䠽䠾躿軀軁䠿軂軃軄軅䡀軆軇䡁軈軉" },
{ 159, "車", "車车軋轧䡂䡃䡄軌軍轨䡅䢀軎軏軐軑軒軓軔軕轩轪轫䡆䡇䡈䡉䡊䡋䡌䡍䡎䢁軖軗軘軙軚軛軜軝軞軟軠軡転軣转轭轮软轰䡏䡐䡑䡒䢂軤軥軦軧軨軩軪軫軬軮軯軰軱軲軳軴軵軶軷軸軹軺軻軼軽轱轲轳轴轵轶轷轸轹轺轻䡓䡔䡕䡖䡗軭軾軿輀輁輂較輄輅輆輇輈載輊輋輌轼载轾轿辀辁辂较䡘䡙䡚䡛輍輎輏輐輑輒輓輔輕辄辅辆䡜䡝䡞䡟輖輗輘輙輚輛輜輝輞輟輠輡輢輣輤輥輦輧輨輩輪輫輬辇辈辉辊辋辌辍辎輦輪䡠䡡䡢䡣䡤輭輮輯輰輱輲輳輴輵輶輷輸輹輺輻輼辏辐辑辒输辔輻䡥䡦䡧䡨䡩䡪輽輾輿轀轁轂轃轄轅辕辖辗䡫䡬䡭䡮䡯䡰䡱轆轇轈轉轊轋轌辘䡲䡳䡴䡵轍轎轏轐轑轒轓轔辙辚䡶轕轖轗轘轙轚䡷䡸䡹轛轜轝轞轟䡺䡻轠轡轢轢轣轤䡼䡽䡾轥䡿" },
{ 160, "辛", "辛辜辝辞辟辠辡辢辣䢃辤辥辦辧辨辩辪辫辬辭䢄辮辯" },
{ 161, "辰", "辰辱䢅農䢆䢇辳辴䢈䢉" },
{ 162, "辵", "辵辶辷辸边辺辻込辽䢊䢋达辿迀迁迂迃迄迅迆过迈迉䢌䢍䢎䢏迊迋迌迍迎迏运近迒迓返迕迖迗还这迚进远违连迟迬﨤䢐䢑迠迡迢迣迤迥迦迧迨迩迪迫迭迮迯述迱迲迳䢒䢓䢔䢕䢖䢗䢘迴迵迶迷迹迺迻迼追迾迿退送适逃逄逅逆逇逈选逊䢙䢚䢛逋逌逍逎透逐逑递逓途逕逖逗逘這通逛逜逝逞速造逡逢連逤逥逦逧連䢜䢝䢞䢟䢠迸逨逩逪逫逬逭逮逯逰週進逳逴逵逶逷逸逹逺逻逸䢡逼逽逾逿遀遁遂遃遄遅遆遇遈遉遊運遌遍過遏遐遑遒道達違遖遗䢢䢣䢤䢥遘遙遚遛遜遝遞遟遠遡遢遣遤遥䢦䢧䢨䢩遦遧遨適遪遫遬遭遮遯遰遱遳䢪䢫䢬䢭遲遴遵遶遷選遹遺遻遼邆遼䢮遽遾避邀邁邂邃還邅邉䢯䢰邇邈䢱邊邋邌邍邎邏邐邏䢲" },
{ 163, "邑", "邑䢳邒邓䢴邔邕邖邗邘邙邚邛邜邝䢵䢶䢷邞邟邠邡邢那邤邥邦邧邨邩邪邫邬䢸䢹䢺邭邮邯邰邱邲邳邴邵邶邷邸邹邺邻䢻䢼䢽䢾䢿䣀䣁䣂邼邽邾邿郀郁郂郃郄郅郆郇郈郉郊郋郌郍郎郏郐郑郓郎䣃䣄䣅䣆䣇䣈䣉郒郔郕郖郗郘郙郚郛郜郝郞郟郠郡郢郣郤郥郦郧䣊䣋䣌䣍䣎䣏部郩郪郫郬郭郮郯郰郱郲郳郴郵郶郷郸䣐䣑䣒郹郺郻郼都郾郿鄀鄁鄂鄃鄄鄅鄆鄇鄈鄉鄊都䣓䣔䣕䣖䣗鄋鄌鄍鄎鄏鄐鄑鄒鄓鄔鄕鄖鄗䣘䣙䣚䣛䣜鄘鄙鄚鄛鄜鄝鄞鄟鄠鄡鄢鄣鄤鄥䣝䣞䣟䣠鄦鄧鄨鄩鄪鄫鄬鄭鄮鄯鄰鄱鄲䣡鄳鄴鄵鄶鄷䣢鄸鄹鄺鄻鄼鄽鄾鄿酀酂酁酃酄酅酆酇酈䣣䣤" },
{ 164, "酉", "酉䣥䣦酊酋䣧䣨酌配酎酏酐酑酒䣩䣪䣫䣬䣭酓酔酕酖酗酘酙酚酛酜酝酞䣮䣯䣰䣲䣳酟酠酡酢酣酤酥䣴䣵䣶䣷䣸䣹酦酧酨酩酪酫酬酭酮酯酰酱酪䣺䣻酲酳酴酵酶酷酸酹酺酻酼酽酾酿䣼䣽䣾䣿醀醁醂醃醄醅醆醇醈醉醊醋醌䤀䤁䤂䤃䤄䤅䤆䤇䤈醍醎醏醐醑醒醓醔醕醖醗䤉䤊䤋䤌醘醙醚醛醜醝醞醟醠醡醢醣醤䤍醥醦醧醨醩醪醫醬䤎䤏䤐䤑䤒醭醮醯醰醱醲醳醴醵醶醷醸醴䤓䤔醹醺醻䤕䤖醼䤗䤘醽醾醿釀釁釂釃釄釅䤙" },
{ 165, "釆", "釆采釈釉释釋" },
{ 166, "里", "里重䤚野量釐" },
{ 167, "金", "金釒钅釓釔钆钇䤛釕釖釗釘釙釚釛釜針釞釟釠釡釢针钉钊钋钌䤜釣釤釥釦釧釨釩釪釫釬釭釮釯釰釱釲釳釴釵釶釷釸釹釺釻釼钍钎钏钐钑钒钓钔钕钖钗䤝䤞䤟䤠䥺䥻䥼釽釾釿鈀鈁鈂鈃鈄鈅鈆鈇鈈鈉鈊鈋鈌鈍鈎鈏鈐鈑鈒鈓鈔鈕鈖鈗鈘鈙鈚鈛鈜鈝鈞鈟鈠鈡鈢鈣鈤鈥鈦鈧鈨鈩鈪鈫鈬钘钙钚钛钜钝钞钟钠钡钢钣钤钥钦钧钨钩钪钫钬钭钮钯䤡䤢䤣䥽䥾䥿鈭鈮鈯鈰鈱鈲鈳鈴鈵鈶鈷鈸鈹鈺鈻鈼鈽鈾鈿鉀鉁鉂鉃鉄鉅鉆鉇鉈鉉鉊鉋鉌鉍鉎鉏鉐鉑鉒鉓鉔鉕鉖鉗鉘鉙鉚鉛鉜鉝鉞鉟鉠鉡鉢鉣鉤鉥鉦鉧鉨鉩鉪鉫鉬鉭鉮鉯鉰鉱鉲鉳鉴銏钰钱钲钳钴钵钶钷钸钹钺钻钼钽钾钿铀铁铂铃铄铅铆铇铈铉铊铋铌铍铎鈴䤤䤥䤦䤧䤨䤩䤪䦀鉵鉶鉷鉸鉹鉺鉻鉽鉾鉿銀銁銂銃銄銅銆銇銈銉銊銋銌銍銎銐銑銒銓銔銕銖銗銘銙銚銛銜銝銞銟銠銡銢銣銤銥銦銧銨銩銪銫銬銭銮銯銰銱铏铐铑铒铓铔铕铖铗铘铙铚铛铜铝铞铟铠铡铢铣铤铥铦铧铨铩铪铫铬铭铮铯铰铱铲铳铴铵银铷䤫䤬䤭䤮䤯䤰䤱䤲䦁銲銳銴銵銶銷銸銹銺銻銼銽銾銿鋀鋁鋂鋃鋄鋅鋆鋇鋈鋉鋊鋋鋌鋍鋎鋏鋐鋑鋒鋓鋔鋕鋖鋗鋘鋙鋚鋛鋜鋝鋞鋟鋠鋡鋢鋣鋤鋥鋦鋧鋨鋩鋪鋫鋬鋭鋮鋯鋰鋱鋲鋳鋴鋵鋶铸铹铺铻铼铽链铿销锁锂锃锄锅锆锇锈锉锊锋锌锍锎锏锐锑锒锓锔锕﨧䤳䤴䤵䤶鉼鋷鋸鋹鋺鋻鋼鋽鋾鋿錀錁錂錃錄錅錆錇錈錉錊錋錌錍錎錏錐錑錒錓錔錕錖錗錘錙錚錛錜錝錞錟錠錡錢錣錤錥錦錧錩錪錫錬錭錮錯錰錱録錳錴錵錶錷錸錹錺錻錼錽錾錿鍀鍁鍂鍃鍄鍅鍆鍈锖锗锘错锚锛锜锝锞锟锠锡锢锣锤锥锦锧锨锩锪锫锬锭键锯锰锱錄﨨䤷䤸䤹䤺䤻䤼錨鍇鍉鍊鍋鍌鍍鍎鍏鍐鍑鍒鍓鍔鍕鍖鍗鍘鍙鍚鍛鍜鍝鍞鍟鍠鍡鍢鍣鍤鍥鍦鍧鍨鍩鍪鍫鍬鍭鍮鍯鍰鍱鍲鍳鍴鍵鍶鍷鍸鍹鍺鍻鍼鍽鍾鍿鎀鎁鎂鎃鎄鎅鎆鎇锲锳锴锵锶锷锸锹锺锻锼锽锾锿镀镁镂镃镄镅鍊䤽䤾䤿䥀䥁䥂䥃䥄䥅䥆䥇䦂鎈鎉鎊鎋鎌鎍鎎鎏鎐鎑鎒鎓鎔鎕鎖鎗鎘鎙鎚鎛鎜鎝鎞鎟鎠鎡鎢鎣鎤鎥鎦鎧鎨鎪鎫鎬鎭鎮鎯鎰鎱鎲鎳鎴鎵鎶鎷鎸鎹鎺鎻鎼鎽鎾鎿镆镇镈镉镊镋镌镍镎镏镐镑镒镓镔镕䥈䥉䥊䥋䥌䥍䥎䥏䥐䥑䥒䥓鎩鏀鏁鏂鏃鏄鏅鏆鏇鏈鏉鏊鏋鏌鏍鏎鏏鏐鏑鏒鏓鏔鏕鏖鏗鏘鏙鏚鏛鏜鏝鏞鏟鏠鏡鏢鏣鏤鏥鏦鏧鏨鏩鏪鏫鏬鏭鏮鏯鏰鏱鏲鏹镖镗镘镙镚镛镜镝镞镟镠䥔䥕䥖䥗䥘䥙䥚䥛䥜䦃䦄䦅鏳鏵鏶鏷鏸鏺鏻鏼鏽鏾鏿鐀鐁鐂鐃鐄鐅鐆鐇鐈鐉鐊鐋鐌鐍鐎鐏鐐鐑鐒鐓鐔鐕鐖鐗鐘鐙鐚鐛鐜鐝鐞鐟鐠鐡鐢鐣鐤鐥鐦鐧鐨镡镢镣镤镥镦镧镨镩镪镫䥝䥞䥟䥠䥡䥢䥣䥤䥥䥦鏴鐩鐪鐫鐬鐭鐮鐯鐰鐱鐲鐳鐴鐵鐶鐷鐸鐹鐺鐻鐼鐽鐾鐿鑀鑁镬镭镮镯镰镱䥧䥨䥩䥪䥫䥬䥭䥮鑂鑃鑄鑅鑆鑇鑈鑉鑊鑋鑌鑍鑎鑏鑐鑑鑒鑓鑔鑧镲䥯䥰䥱䥲䥳䥴鑕鑖鑗鑘鑙鑚鑛鑜鑝鑞鑟鑠鑡鑢鑣鑤鑥鑦镳镴䥵䥶䥷鑨鑩鑪鑫鑬䥸鑭鑮鑯鑰鑱鑲鑳钄镵镶鑴鑵鑶鑷鑸鑹鑺鑻鑼鑽鑾鑿䦆钀钁钂䥹钃" },
{ 168, "長", "長镸长䦇镹镺䣱䦈䦉镻䦊镼䦋镽镾" },
{ 169, "門", "門门閁閂闩閃閄閅闪䦌䦍閆閇閈閉閊闫闬闭问闯䦎䦏䦐䦑開閌閍閎閏閐閑閒間閔閕閖閗闰闱闲闳间闵闶闷䦒䦓䦔閘閙閚閛閜閝閞閟閠闸闹䦕䦖䦗䦘䦙䦚䦛䦶閡関閣閤閥閦閧閨閩閪闺闻闼闽闾闿阀阁阂䦜䦝䦞䦟䦷閫閬閭閮閯閰閱閲閳閴阃阄阅阆閭䦠䦡䦢䦣䦤䦥䦦䦧䦨閵閶閸閹閺閻閼閽閾閿闀闁闂阇阈阉阊阋阌阍阎阏阐䦩䦪䦫䦬䦭䦮䦯䦸閷闃闄闅闆闇闈闉闊闋闌闍闎闏阑阒阓阔阕闐闑闒闓闔闕闖闗闘阖阗阘阙䦰闙闚闛關闝阚䦱闞闟闠闡䦲䦳䦴闢闣闤闥闦阛䦵闧" },
{ 170, "阜", "阜阝䦹䦺阞队䦻阠阡阢阣阤䦼䦽䦾䦿䧀阥阦阧阨阩阪阫阬阭阮阯阰阱防阳阴阵阶阮䧁䧂䧃阷阸阹阺阻阼阽阾阿陀陁陂陃附际陆陇陈陉䧄䧅䧆䧇䧈陊陋陌降陎陏限陑陒陓陔陕降䧉䧊䧋䧌䧍䧎䧏陖陗陘陙陛陜陝陞陟陠陡院陣除陥陦陧陨险䧐䧑䧒䧓䧔䧕䧖陚陪陫陬陭陮陯陰陱陲陳陴陵陶陷陸陹険陵陸䧗䧘䧙陻陼陽陾陿隀隁隂隃隄隅隆隇隈隉隊隋隌隍階随隐隆䧚䧛䧜䧝䧞䧟隑隒隓隔隕隖隗隘隙﨩䧠䧡䧢䧣隚際障隝隞隟隠隡䧤䧥䧦䧩隢隣隤隥隣䧧䧨䧪隦隧隨隩險隫䧫䧬䧭隬隭隮隯隰隱隲隳䧮隴䧯隵䧰" },
{ 171, "隶", "隶隷隸隸" },
{ 172, "隹", "隹䧱隺隻隼隽难䧲䧳隿雀䧴䧵䧶雁雂雃雄雅集雇雈䧷䧸䧹䧺雉雊雋雌雍雎雏䧻雐雑雒䧼䧽雓䧾䧿雔雕䨁䨂雖䨃雗雘雙雚雛雜雝雞雟雠䨄雡離難離䨅䨆䨇雤䨈雥雦䨉雧䨊" },
{ 173, "雨", "雨䨋雩雪雫䨌䨍雬雭雮雯雰雱雲雳䨎雴雵零雷雸雹雺電雼雽雾雷陋零䨏䨐䨑䨒䨓䨔䨕䨖雿需霁䨗䨘䨙霂霃霄霅霆震霈霉霊䨚䨛䨜䨝霋霌霍霎霏霐霑霒霓霔霕霖霗䨞䨟䨠䨡䨢䨣䨤霘霙霚霛霜霝霞霟霠䨥䨦䨧䨨䨩䨪霡霢霣霤霥䨫䨬䨭䨮䨯霦霧霨霩霪霫霬霭䨰䨱霮霯霰霱露霳霴露霵霶霷霸霹霺霻䨲䨳䨴霼霽霾霿靀䨵䨶靁䨷靂靃靄靅靆靇靈靈䨸靉靊䨹靋靌靍靎靏䨺靐䨻" },
{ 174, "靑", "靑青靓靔靕靖靖靗靘静靚靛靜靝䨼" },
{ 175, "非", "非䨽䨾䨿靟䩀靠靡䩁" },
{ 176, "面", "面靣䩂䩃䩄䩅䩆䩇靤靥䩈䩉靦䩊䩋䩌䩍靧䩎靨䩏" },
{ 177, "革", "革靪䩐䩑䩒靫靬靭靮靯靰靱䩓䩔䩕䩖䩗䩘靲靳靴靵靶靷靸靹䩙䩚䩛䩜䩝䩞靺靻靼靽靾靿鞀鞁鞂鞃鞄鞅鞆䩟鞇鞈鞉鞊鞋鞌鞍鞎鞏鞐鞑鞒䩠䩡䩢䩣䩤䩥䩦䩧鞓鞔鞕鞖鞗鞘鞙䩨䩩䩪䩫䩬䩭䩮鞚鞛鞜鞝鞞鞟鞠鞡䩯䩰䩱䩲䩳䩴䩵鞢鞣鞤鞥鞦鞧鞨鞩鞪鞫鞬鞭鞮鞯鞰䩶䩷䩸䩹䩺䩻鞱鞲鞳鞴鞵鞶鞷䩼䩽䩾鞸鞹鞺鞻䩿䪀䪁䪂䪃䪄鞼鞽鞾鞿䪅䪆韀韁韂韃䪇䪈韄韅䪉韆韇韈䪊䪋䪌䪍韉䪎韊" },
{ 178, "韋", "韋韦韌韧䪏䪐䪑䪒䪓韍韎韨韏韐韑䪔韒䪕韓韔韕韩䪖䪗䪘韖韗韘韙韚韪韫䪙䪚韜韝韞韟韬韛韠䪛韡韢䪜韣䪝韤韥" },
{ 179, "韭", "韭䪞韮䪟韯韰䪠韱䪡䪢韲䪣䪤䪥" },
{ 180, "音", "音䪦䪧䪨䪩韴韵䪪韶韷䪫䪬韸䪭韹韺䪮䪯韻韼韽韾響䪰頀" },
{ 181, "頁", "頁页頂頃頄顶顷䪱䪲項順頇須頉顸项顺须䪳䪴䪵頊頋頌頍頎頏預頑頒頓頙顼顽顾顿颀颁颂颃预䪶䪷䪸䪹䪺䪻䪼䪽䪾頔頕頖頗領頚颅领颇颈領䪿䫀䫁䫂頛頜頝頞頟頠頡頢頣頦頧頨頩頪頫頬颉颊颋颌颍颎颏䫃䫄䫅䫆䫇䫈䫉䫊頤頥頭頮頯頰頱頲頳頴頵頶頷頸頹頺頻頼頽颐频颒颓颔颕颖頻䫋䫌䫍䫎䫏䫐䫑䫒䫓頿顀顁顂顃顄顅顆顇顈顉顊颗䫔䫕䫖䫗䫘䫙䫚䫛䫜䫝頾顋題額顎顏顐顑顒顓顔顕题颙颚颛颜额䫞䫟䫠䫡䫢䫣䫤䫥䫦䫧顖顗願顙顚顛顜顝類颞颟颠颡類䫨䫩䫪䫫顟顠顡顢顣䫬䫭䫮䫯䫰䫱顤顥顦顧顨颢颣䫲䫳䫴顩顪顫颤顬顭顮顯颥䫵䫶顰颦䫷顱顲颧顳顴" },
{ 182, "風", "風风䫸䫹颩颪飏䫺䫻䫼䫽颫颬䫾䫿䬀䬁䬂䬃颭颮颯颰颱飐飑飒䬄䬅颲颳䬆䬇䬈䬉䬊颴颵䬋䬌䬍䬎䬏䬐颶颷飓䬑䬒䬓䬔䬕䬖䬗颸颹颺飔飖䬘䬙䬚颻颼颽颾颿飀飕飗䬛䬜飁飂飃飄飘䬝飅飆飇飈飉飊飙飚飋䬞䬟飌飍" },
{ 183, "飛", "飛飞䬠䬡飜飝" },
{ 184, "食", "食飠饣䬢飡飢飣飤饤饥䬣䬤䬥飥飦飧飨饦饧䬦䬧䬨䬩䬪飩飪飫飬飭飮飯飰飱飲饨饩饪饫饬饭饮飯䬫䬬䬭䬮䬯䬰䬱䬲䬳䬴飳飴飵飶飷飸飹飻飼飽飾飿饯饰饱饲饳饴飼䬵䬶䬷䬸䬹䬺䬻飺餀餁餂餃餄餆餇餈餉養餋餌餍餎餏饵饶饷饸饹饺饻饼䬼䬽䬾䬿䭀䭁䭂餐餑餒餓餔餕餖餗餘餙餝饽饾饿馀馁馂䭃䭄䭅䭆䭇餅餚餛餜餞餟餠餡餢餣餤餥餦餧館餩馃馄馅馆館䭈䭉䭊䭋䭌䭍䭎䭏餪餫餬餭餮餯餰餱餲餳餴餵餷馇馈馊馋䭐䭑䭒䭓䭔餶餸餹餺餻餼餽餾餿饀饁饂饃馉馌馍馎馏馐䭕䭖䭗饄饅饆饇饈饉馑馒䭘䭙䭚䭛䭜䭪饊饋饌饍饎饏饐饑饒饓馓馔䭝䭞䭟䭠饔饕饖饗饘饙䉵䭡䭢䭣䭤饚饛饜䭥饝䭦䭧饞饟䭨䭩饠饡饢馕" },
{ 185, "首", "首馗䭫䭬馘䭭䭮" },
{ 186, "香", "香馚䭯馛馜馝馞馟馠䭰䭱䭲馡馢馣馤馥馦馧馨馩馪䭳馫" },
{ 187, "馬", "馬马䭴馭馮馱驭䭵䭶馯馰馲馳馴馵驮驯驰䭷䭸䭹䭺䭻䭼䭽䭾馶馷馸馹馺馻馼馽馾馿駀駁駂駃駄駅駆駇驱驲驳驴䭿䮀䮁䮂䮃䮄䮅駈駉駊駋駌駍駎駏駐駑駒駓駔駕駖駗駘駙駚駛駜駝駞駟駠驵驶驷驸驹驺驻驼驽驾驿骀䮆䮇䮈䮉䮊䮋䮌䮍䯃駡駢駣駤駥駦駧駨駩駪駫駬駭駮駯駰駱駲骁骂骃骄骅骆骇骈骉駱䮎䮏䮐䮑䮒䯄駴駵駶駷駸駹駺駻駼駽駾駿騀騁騂騃骊骋验骍骎骏䮓䮔䮕䮖䮗䮘䮙䮚䮛駳騄騅騆騇騈騉騊騋騌騍騎騏騐騑騒験骐骑骒骓骔骕骖䮜䮝䮞䮟䮠䮡䮢騔騕騖騗騘騙騚騛騜騝騞騟騠騡騢騣騤騥騦騧騨骗骘骙骚骛䮣䮤䮥䮦䮧䮨䮩䯅騩騪騫騬騭騮騯騰騱騲騳騴騵騶騷騸骜骝骞骟䮪䮫䮬䮭䮮䮯䮰䮱騹騺騻騼騽騾騿驀驁驂驃驄驅驆驇骠骡骢䮲䮳䮴䮵䮶驈驉驊驋驌驍驎驏驐驑驒驓驔驕骣䮷䮸䮹驖驗驘驙驚驛驜䮺䮻䮼驝驞驟骤䮽䮾驠驡驢驣骥䮿驤驥驦驧骦骧䯀驨驩䯁驪驪䯂"},
{ 188, "骨", "骨䯆䯇骩骪骫骬骭骮䯈䯉骯骰骱䯊䯋䯌䯍䯎骲骳骴骵骶骷䯏䯐䯑䯒䯓䯔骸骹骺骻骼䯕䯖䯗䯘䯙䯚骽骾䯛䯜骿髀髁䯝䯞䯟䯠髂髃髄髅䯡髆髇髈髉髊髋髌䯢髍髎髏䯣髐䯤髑髒髓體䯥髕䯦髖髗"},
{ 189, "高", "高髙䯧䯨䯩髚髛髜䯪䯫髝髞䯬" },
{ 190, "髟", "髟䯭䯮髠髡髢䯯䯰䯱䯲䯳䯴髣髤髥髦髧髨髩髪䯵䯶髫髬髭髮髯髰髱髲髳髴䯷䯸髵髶髷髸髹髺髻鬇䯹䯺䯻䯼髼髽髾髿鬀鬁鬂䯽䯾䯿䰀䰁䰂䰃鬃鬄鬅鬆鬈䰄䰅䰆䰇鬉鬊鬋鬌鬍鬎鬏䰈䰉䰊䰋鬐鬑鬒鬓䰌䰍鬔鬕鬖鬗鬘鬝䰎鬙鬚鬛鬜鬞鬟鬠䰏䰐䰑䰒鬡鬢䰓䰔鬣䰕鬤䰖" },
{ 191, "鬥", "鬥鬦鬧鬨鬩䰗鬪䰘鬫鬬鬭鬮" },
{ 192, "鬯", "鬯鬰鬱" },
{ 193, "鬲", "鬲䰙䰚䰛䰜鬳鬴鬵鬶鬷鬸鬹鬺䰝鬻䰞" },
{ 194, "鬼", "鬼鬽䰟鬾鬿魀魁魂䰠䰡魃魄魅魆䰢䰣魇魈魉䰤䰥䰦䰧魊魋魌魍魎魏䰨䰩䰪魐魑魒魓魔䰫䰬䰭魕魖䰮䰯䰰魗魘魙䰱" },
{ 195, "魚", "魚鱼䰲䰳魛魜魝魞鱽䰴䰵䰶魟魠魡魢鱾䰷䰸䰹䰺䰻䰼䰽䰾䲝魣魤魥魦魧魨魩魪魫魬魭魮魯魰魱魲魳魴魵魶魷魸魹鱿鲀鲁鲂鲃魯䰿䱀䱁䱂䱃䱄䱅䱆䱇䱈䱉䲞䲟魺魻魼魽魾魿鮀鮁鮂鮃鮄鮅鮆鮇鮈鮉鮊鮋鮌鮍鮎鮏鮐鮑鮒鮓鮔鮕鮖鮗鮘鮣鲄鲅鲆鲇鲈鲉鲊鲋鲌鲍鲎鲏鲐䱊䱋䱌䱍䱎鮙鮚鮛鮜鮝鮞鮟鮠鮡鮢鮤鮥鮦鮧鮨鮩鮪鮫鮬鮭鮮鮯鮰鮱鮲鮳鮴鮺鲑鲒鲓鲔鲕鲖鲗鲘鲙鲚鲛鲜鲝鲞鲟䱏䱐䱑䱒䱓䱔䱕䱖䱗䱘鮵鮶鮷鮸鮹鮻鮼鮽鮾鮿鯀鯁鯂鯃鯄鯅鯆鯇鯈鯉鯊鯋鯌鯍鯎鯏鯐鯑鯒鯓鲠鲡鲢鲣鲤鲥鲦鲧鲨鲩鲪鲫鲬䱙䱚䱛䱜䱝䱞䱟䱠䱡䱢䱣䱤䱥䱦䱧䱨䱩䱪鯔鯕鯖鯗鯘鯙鯚鯛鯜鯝鯞鯟鯠鯡鯢鯣鯤鯥鯦鯧鯨鯩鯪鯫鯬鯭鯮鯯鯰鯱鯲鯳鯴鯵鯻鲭鲮鲯鲰鲱鲲鲳鲴鲵鲶鲷鲸鲹鲺鲻䱫䱬䱭䱮䱯䱰䱱䱲䱳䱴䲠䲡鯶鯷鯸鯹鯺鯼鯽鯾鯿鰀鰁鰂鰃鰄鰅鰆鰇鰈鰉鰊鰋鰌鰍鰎鰏鰐鰑鰒鰓鰔鰕鰖鰗鰘鰙鰚鰛鰠鲼鲽鲿鳀鳁鳂鳃鳄鳅鳆鳇鳈鳉鳊鳋䱵䱶䱷䱸䱹䱺䱻䱼䱽䲢䲣䲤鰜鰝鰞鰟鰡鰢鰣鰤鰥鰦鰧鰨鰩鰪鰫鰬鰭鰮鰯鰰鲾鳌鳍鳎鳏鳐鳑鳒䱾䱿䲀䲁䲂䲃䲄䲅䲆䲇䲈鰱鰲鰳鰴鰵鰶鰷鰸鰹鰺鰻鰼鰽鰾鰿鱀鱁鱂鱃鱄鱅鱆鱇鱈鳓鳔鳕鳖鳗鳘鳙鳚鳛鷠䲉䲊䲋䲌䲍䲎䲏鱉鱊鱋鱌鱍鱎鱏鱐鱑鱒鱓鱔鱕鱖鱗鱘鱙鱚鱛鳜鳝鳞鳟鱗䲐䲑䲒䲓䲔䲕鱜鱝鱞鱟鱠鱡鱢鱣鱤鱥鱦鱧鱩鱪鱫鳠鳡鳢鳣䲖䲗䲘鱨鱬鱭鱮鱯鱰鳤䲙鱱鱲鱳鱴鱵鱶䲚䲛鱷鱸鱹鱺鱻䲜" },
{ 196, "鳥", "鳥鸟鳦䲥鳧鳨鳩鳪鳫鳬鳭鳮鳯鳰鸠鸡䲦䲧䲨䲩䲪䲫鳱鳲鳳鳴鳵鳶鸢鸣鸤䲬䲭䲮䲯䲰䲱䲲䲳䲴䲵䲶䲷䲸䴓鳷鳸鳹鳺鳻鳼鳽鳾鳿鴀鴁鴂鴃鴄鴅鴆鴇鴈鴉鴋鴌鴍鴎鸥鸦鸧鸨鸩䲹䲺䲻䲼䲽䲾䲿䳀䳁䳂䳃䳄䳅䳆䳇䳈䳉䳊鴊鴏鴐鴑鴒鴓鴔鴕鴖鴗鴘鴙鴚鴛鴜鴝鴞鴟鴠鴡鴢鴣鴤鴥鴦鴧鴨鴩鴪鴫鴬鸪鸫鸬鸭鸮鸯鸰鸱鸲鸳鸴鸵鸶䳋䳌䳍䳎䳏䳐䳑䳒䳓䳔䴔䴕鴭鴮鴯鴰鴱鴲鴳鴴鴵鴶鴷鴸鴹鴺鴻鴼鴽鴾鴿鵀鵁鵂鵃鵄鵅鵆鵇鵈鵉鸷鸸鸹鸺鸻鸼鸽鸾鸿䳕䳖䳗䳘䳙䳚䳛䳜鵊鵋鵌鵍鵎鵏鵐鵑鵒鵓鵔鵕鵖鵗鵘鵙鵚鵛鵜鵝鵞鵟鵠鵡鵢鵣鵥鹀鹁鹂鹃鹄鹅鹆鹇鹈䳝䳞䳟䳠䳡䳢䳣䳤䳥䴖鵦鵧鵨鵩鵪鵫鵬鵭鵮鵯鵰鵱鵲鵳鵴鵵鵶鵷鵸鵹鵺鵻鵼鵽鵾鵿鶀鶁鶂鶃鶄鶅鶆鶇鶈鶉鶊鶋鶌鶍鶎鶏鶑鹉鹊鹋鹌鹍鹎鹏鹐鹑鹒鹓鹔䳦䳧䳨䳩䳪䳫䳬䳮䳯䳰䴗鶐鶒鶓鶔鶕鶖鶗鶘鶙鶚鶛鶜鶝鶞鶟鶠鶡鶢鶣鶤鶥鶦鶧鶨鶩鶪鶫鹕鹖鹗鹙鹚鹛鹜䳱䳲䳳䳴䳵䳶䴘鶬鶭鶮鶯鶰鶱鶲鶳鶴鶵鶶鶷鶸鶹鶺鶻鶼鶽鶾鶿鷀鷁鷂鷃鷄鷅鷆鷇鷈鷉鷊鷌鷍鷎鷏鹘鹝鹞鹟鹠鹡鹢鹣鹤鶴䳷䳸䳹䳺䳻䳼䳽鷋鷐鷑鷒鷓鷔鷕鷖鷗鷘鷙鷚鷛鷜鷝鷞鷟鹥鹦鹧鹨䳾䳿䴀䴁䴂䴃䴄䴅䴆鷡鷢鷣鷤鷥鷦鷧鷨鷩鷪鷫鷬鷭鷮鷯鷰鷱鷲鷳鷴鷵鷶鷷鷸鷺鷻鷼鹩鹪鹫鹬鷺䴇䴈䴉䴊䴋䴙鷹鷽鷾鷿鸀鸁鸂鸃鸄鸅鸆鸇鸈鸉鸊鹭鹮鹯鹰䴌䴍鸋鸌鸍鸎鸏鸐鸑鸒鹱鹲䴎鸓鸔䴏鸕鸖鸗鸘鸙鸚鹳鹴鸛鸜鸝鸞鸞䴐䴑䴒" },
{ 197, "鹵", "鹵䴚鹶鹷䴛鹸鹹鹾䴜鹺鹻䴝鹼鹽䴞" },
{ 198, "鹿", "鹿麀麁麂䴟䴠䴡䴢麃麄䴣䴤䴥麅麆麇麈麉麊麋䴦麌麍麎麏麐䴧麑麒麓麔麕麖麗麗麘麙麚麛䴨麜麝䴩麞麟麟䴪䴫麠麡麢麣麤" },
{ 199, "麥", "麥麦䴬䴭䴮麧䴯䴰麨麩麪麫麸䴱䴲䴳䴴麬麭麮䴵麯麰䴶䴷䴸麱麲䴹䴺䴻䴼䴽麳麴麹麵麺䴾䴿䵀䵁䵂䵅麶䵃䵄䵆麷" },
{ 200, "麻", "麻麼麽䵇麾麿黀䵈䵉黁黂" },
{ 201, "黃", "黃黄䵊黅黆黇黈黉䵋黊黋䵌䵍䵎䵏䵐黌" },
{ 202, "黍", "黍䵑黎黎䵒䵓黏䵔䵕䵖䵗䵘䵙䵚黐䵛䵜" },
{ 203, "黑", "黑黒䵝䵞䵟䵠黓䵡黔黕黖黗默䵢䵣黚黛黜黝點䵤䵥䵦䵧黟黠黡䵨䵩黢黣䵪䵫䵬黤黥黦黧黨黩黪䵭䵮䵯黫黬黭黮黯黰黱䵰黙黲黳黴䵱䵲䵳䵴黵䵵黶黷黸" },
{ 204, "黹", "黹黺黻黼" },
{ 205, "黽", "黽黾黿鼋䵶鼀鼁鼂鼌䵷鼃鼄鼅䵸鼆鼇䵹鼈鼉鼍鼊" },
{ 206, "鼎", "鼎鼏鼐鼑䵺鼒䵻䵼" },
{ 207, "鼓", "鼓鼔䵽䵾䵿鼕鼖䶀鼗䶁鼘鼙鼚鼛鼜鼝鼞鼟" },
{ 208, "鼠", "鼠鼡䶂䶃鼢鼣鼤䶄鼥鼦鼧鼨鼩鼪鼫鼬䶅鼭鼮鼯鼰䶆鼱䶇鼲鼳鼴鼵䶈䶉鼶鼷鼸鼹鼺" },
{ 209, "鼻", "鼻鼼鼽鼾鼿䶊䶋䶌齀齁䶍䶎䶏齂齃齄齅齆齇䶐齈䶑齉" },
{ 210, "齊", "齊齐䶒䶓齋齌齍齎齏齑" },
{ 211, "齒", "齒歯齿齓齔龀䶔齕龁䶕䶖齖齗齘龂䶗䶘䶙齙齚齛齜齝齞齟齠齡齢齣龃龄龅龆䶚䶛齤齥齦齧齨齩龇龈䶜䶝齪齫齬龉龊䶞䶟齭齮齯齰齱䶠䶡䶢齲齳齴齵齶齷龋龌䶣䶤齸齹齺齻䶥䶦䶧䶨齼齽䶩䶪䶫齾" },
{ 212, "龍", "龍龙龎龏龐䶭䶮龑龒䶬龓龔龕龚龛龖龗龘"},
{ 213, "龜", "龜龟䶯䶰䶱䶲龝龞" },
{ 214, "龠", "龠䶳龡龢䶴龣龤龥䶵" }
};



/** @brief Constructor string editor.
 *  String editor with Ascii, Pinyin, Handwriting, Radicals and Bart Houkes Food methods.
 *  @param w [in] Width of edit string.
 *  @param h [in] Height of edit string.
 *  @param flags [in] How to present the data.
 */
CstringDialog::CstringDialog( int maxChars, int w, int h, int flags)
: Cdialog( NULL, "CstringDialog", STRING_DIALOG_RECT)
, m_flags( flags & 0xff)
, m_show( (flags & MONEY_SHOW_AT_FIRST) ? true:false)
, m_amountKey( (flags & MONEY_NO_CLEAR_AMOUNT) ? true:false)
, m_capital( true)
, m_ascii( false)
, m_show0to9( false)
, m_lastKey( KEY_NONE)
, m_valid( false)
, m_edit_width( w)
, m_edit_height( 6)
, m_max_string_width( maxChars) //(w-1)*(h/2))
, m_position_left(0)
, m_cursor(0)
, m_local(true)
, m_chinese(false)
, m_goLeft( this, m_rect.offset( 0,6, 6,6), KEY_LEFT, ICON_LEFT48)
, m_goRight( this, m_rect.offset( 6,6, 6,6), KEY_RIGHT, ICON_RIGHT48)
, m_erase( this, m_rect.offset( 12,6, 6,6), KEY_DELETE, ICON_ERASER48)
, m_clear( m_rect.offset( 18,6, 52,6), KEY_END, _CLEAR_PICTURE)
, m_ok( this, m_rect.offset( STR_DLG_WIDTH-12,STR_DLG_HEIGHT-6, 12,6), KEY_CR, _OK)
, m_esc( this, m_rect.offset( STR_DLG_WIDTH-24,STR_DLG_HEIGHT-6, 12,6), KEY_ESCAPE, _CANCEL)
, m_shift( this, m_rect.offset( 0, STR_DLG_HEIGHT-6, 9,6), KEY_F5, _SHIFT)
, m_hand( this, m_rect.offset( 9, STR_DLG_HEIGHT-6, 9,6), KEY_F9, _HANDWRITING)
, m_pinyin( this, m_rect.offset( 18, STR_DLG_HEIGHT-6, 9,6), KEY_F6, _PINYIN)
, m_food( this, m_rect.offset( 39, STR_DLG_HEIGHT-6, 9,6), KEY_F7, _FOOD)
, m_radical( this, m_rect.offset( 27, STR_DLG_HEIGHT-6, 12,6), KEY_F10, _RADICAL)
, m_keyboard(NULL)
, m_tone1( this, Crect( m_rect.right()-24, m_rect.top()+6, 6,6), KEY_F1, ICON_TONE_1OFF)
, m_tone2( this, Crect( m_rect.right()-18, m_rect.top()+6, 6,6), KEY_F2, ICON_TONE_2OFF)
, m_tone3( this, Crect( m_rect.right()-12, m_rect.top()+6, 6,6), KEY_F3, ICON_TONE_3OFF)
, m_tone4( this, Crect( m_rect.right()-6 , m_rect.top()+6, 6,6), KEY_F4, ICON_TONE_4OFF)
, m_selectedTone(0)
, m_searchString( this, m_rect.offset( 20,6, 20,6), KEY_F8, "")
, m_gum( this, Crect( m_rect.right()-32, m_rect.top()+6, 8,6), KEY_F8, ICON_ERASE48)
, m_moveUp( this,Crect( m_rect.left()+24, m_rect.top()+6, 6,6), KEY_UP, ICON_UP48)
, m_moveDown( this, Crect( m_rect.left()+32, m_rect.top()+6, 6,6), KEY_DOWN, ICON_DOWN48)
, m_symbolsHorizontal(3)
, m_symbolsVertical(3)
, m_handWriter( this, m_rect.offset( 12,12, STR_DLG_WIDTH-12, STR_DLG_HEIGHT-18))
, m_radicalList( this, m_rect.offset( 0,30, STR_DLG_WIDTH, 4*6))
, m_symbolList( this, m_rect.offset( 0,12, STR_DLG_WIDTH, 24))
{
	(void)h;
	registerChild( &m_radicalList);
	registerChild( &m_symbolList);
	m_symbolList.m_firstKey =KEY_FOUND1;
	m_clear.setImage( ICON_CANCEL32, GRAVITY_RIGHT_CENTER);
	m_symbolList.setCursor(-1);
	for (int i=0; i<RADICAL_COUNT; i++)
	{
		m_radicalList.push_back( radicalData[i].radical);
	}

	registerObject( &m_esc);
	registerObject( &m_ok);
	registerObject( &m_goLeft);
	registerObject( &m_goRight);
	registerObject( &m_erase);
	registerObject( &m_tone1);
	registerObject( &m_tone2);
	registerObject( &m_tone3);
	registerObject( &m_clear);
	registerObject( &m_gum);
	//registerObject( &m_moveUp);
	//registerObject( &m_moveDown);
	registerObject( &m_tone4);
	registerObject( &m_shift);
	if ( CFG("handwriting"))
	{
		registerObject( &m_hand);
	}
	registerObject( &m_handWriter);
	registerObject( &m_radical);
	if ( CFG("input_method_pinyin"))
	{
		registerObject( &m_pinyin);
	}
	if ( CFG("input_method_food"))
	{
		registerObject( &m_food);
	}
	m_symbolList.setColours( COLOUR("COLOUR_BUTTON3_TEXT"), COLOUR("COLOUR_BUTTON3_BACKGROUND"));

	m_returnAtZero = (flags & MONEY_LEADING_ZERO) ? true:false;
	m_ascii = (flags & MONEY_ASCII_ONLY) ? true:false;
	m_layout =LAYOUT_LOCAL;
}

/** @brief Close the string dialog */
CstringDialog::~CstringDialog()
{
	if ( m_keyboard !=NULL)
	{
		delete m_keyboard;
		m_keyboard =NULL;
	}
}

/** @brief Touch a radical on screen. Find all Chinese symbols with that radical.
 *  @param radicalIndex [in] Radical press.
 */
void CstringDialog::touchRadical( int radicalIndex)
{
	if ( radicalIndex<0 || radicalIndex >=RADICAL_COUNT)
	{
		return;
	}
	if ( m_radicalList.m_cursor !=radicalIndex)
	{
		m_radicalList.setCursor( radicalIndex);
		m_symbolList.clear();
		m_symbolList.setSymbols( radicalData[ radicalIndex].characters);
	}
}

/** @brief Change entire content of the string to edit with this value.
 *  @param key [in] New value string.
 */
void CstringDialog::replaceChinese( const std::string &key)
{
	m_string =key;
	m_string2 =key;
	m_cursor =m_string2.length();
	invalidate();
}

/** @brief Insert a string, usually containing one chinese character.
 *  @param key [in] What chinese character.
 */
void CstringDialog::insertChinese( const std::string &key)
{
	utf8string zs =m_string;
	if ( (int)zs.size()>=m_max_string_width)
	{
		return;
	}
	utf8string zf(m_foundSymbols);

	zs.insert( m_cursor, key);
	m_cursor++;
	m_string =zs;
	invalidate();
}

/** @brief Tell how to sing the character.
 *  @param tone [in] What tone 1..4
 */
void CstringDialog::setTone( int tone)
{
	m_selectedTone =tone;
	m_tone1.setImage( (tone==1) ? ICON_TONE_1ON:ICON_TONE_1OFF, GRAVITY_CENTER);
	m_tone2.setImage( (tone==2) ? ICON_TONE_2ON:ICON_TONE_2OFF, GRAVITY_CENTER);
	m_tone3.setImage( (tone==3) ? ICON_TONE_3ON:ICON_TONE_3OFF, GRAVITY_CENTER);
	m_tone4.setImage( (tone==4) ? ICON_TONE_4ON:ICON_TONE_4OFF, GRAVITY_CENTER);
	invalidate();
}

/** @brief Change layout for the string editor. Following modes are supported: A-Z, a-z, pinyin, handwriting, food, food-words
 *  @param newLayout [in] What layout we like.
 */
void CstringDialog::setLayout( Elayout newLayout)
{
	if ( m_keyboard)
	{
		delete m_keyboard;
		m_keyboard =NULL;
	}
	m_layout =newLayout;

	switch (m_layout)
	{
	case LAYOUT_LOCAL:
		m_handWriter.setVisible( false);
		m_radicalList.setVisible( false);
		m_symbolList.setVisible( false);
		m_keyboard =new Ckeyboard( this, m_rect.left()+6, m_rect.bottom()-45, KEYBOARD_LOWERCASE_QWERTY);
		m_shift.setColours( COLOUR("COLOUR_SELECTED_TEXT"), COLOUR("COLOUR_SELECTED_BACKGROUND"));
		m_pinyin.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_food.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_radical.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_hand.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_gum.setVisible(false);
		m_searchString.setVisible(false);
		m_moveUp.setVisible( false);
		m_moveDown.setVisible( false);
		m_tone1.setVisible( false);
		m_tone2.setVisible( false);
		m_tone3.setVisible( false);
		m_tone4.setVisible( false);
		m_clear.setVisible( false);
		break;

	case LAYOUT_LOCAL_CAPITAL:
		m_handWriter.setVisible( false);
		m_radicalList.setVisible( false);
		m_symbolList.setVisible( false);
		m_shift.setColours( COLOUR("COLOUR_SELECTED_TEXT"), COLOUR("COLOUR_SELECTED_BACKGROUND"));
		m_pinyin.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_food.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_radical.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_hand.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_gum.setVisible(false);
		m_searchString.setVisible(false);
		m_moveUp.setVisible( false);
		m_moveDown.setVisible( false);
		m_tone1.setVisible( false);
		m_tone2.setVisible( false);
		m_tone3.setVisible( false);
		m_tone4.setVisible( false);
		m_clear.setVisible( false);
		m_keyboard =new Ckeyboard( this, m_rect.left()+6, m_rect.bottom()-45, KEYBOARD_UPPERCASE_QWERTY);
		break;

	case LAYOUT_RADICAL:
		m_handWriter.setVisible( false);
		m_radicalList.setVisible( true);
		m_symbolList.setVisible( true);
		m_symbolList.setSpan( m_rect.width()/6);
		m_symbolList.setRect( m_rect.offset( 0,12, m_rect.width(), 3*6));
		m_shift.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_pinyin.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_food.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_radical.setColours( COLOUR("COLOUR_SELECTED_TEXT"), COLOUR("COLOUR_SELECTED_BACKGROUND"));
		m_hand.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_gum.setVisible(true);
		m_searchString.setVisible(false);
		m_moveUp.setVisible( true);
		m_moveDown.setVisible( true);
		m_tone1.setVisible( false);
		m_tone2.setVisible( false);
		m_tone3.setVisible( false);
		m_tone4.setVisible( false);
		m_clear.setVisible( false);
		break;

	case LAYOUT_PINYIN:
		m_handWriter.setVisible( false);
		m_radicalList.setVisible( false);
		m_symbolList.setVisible( true);
		m_symbolList.setSpan( m_rect.width()/6);
		m_symbolList.setRect( m_rect.offset( 0,12, m_rect.width(), 4*6));
		m_pinyin.setColours(  COLOUR("COLOUR_SELECTED_TEXT"), COLOUR("COLOUR_SELECTED_BACKGROUND"));
		m_shift.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_food.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_radical.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_hand.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_gum.setVisible(true);
		m_searchString.setVisible(true);
		m_moveUp.setVisible( true);
		m_moveDown.setVisible( true);
		m_tone1.setVisible( true);
		m_tone2.setVisible( true);
		m_tone3.setVisible( true);
		m_tone4.setVisible( true);
		m_keyboard =new Ckeyboard( this, m_rect.left()+6, m_rect.bottom()-24, KEYBOARD_UPPERCASE);
		m_clear.setVisible( false);
		break;

	case LAYOUT_HANDWRITING:
		m_handWriter.setVisible( true);
		m_radicalList.setVisible( false);
		m_symbolList.setVisible( true);
		m_symbolList.setSpan( 2);
		m_symbolList.setRect( m_rect.offset( 0,12, 12, 7*6));
		m_symbolList.invalidate();
		m_pinyin.setColours(  COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_shift.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_food.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_hand.setColours( COLOUR("COLOUR_SELECTED_TEXT"), COLOUR("COLOUR_SELECTED_BACKGROUND"));
		m_radical.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_gum.setVisible(false);
		m_searchString.setVisible(false);
		m_moveUp.setVisible( false);
		m_moveDown.setVisible( false);
		m_tone1.setVisible( false);
		m_tone2.setVisible( false);
		m_tone3.setVisible( false);
		m_tone4.setVisible( false);
		m_clear.setVisible( true);
		break;

	case LAYOUT_FOOD1:
		m_handWriter.setVisible( false);
		m_radicalList.setVisible( false);
		m_symbolList.setVisible( true);
		m_symbolList.setSpan( m_rect.width()/6);
		m_symbolList.setRect( m_rect.offset( 0,12, m_rect.width(), 4*6));
		m_shift.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_pinyin.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_food.setColours( COLOUR("COLOUR_SELECTED_TEXT"), COLOUR("COLOUR_SELECTED_BACKGROUND"));
		m_hand.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_radical.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_gum.setVisible(true);
		m_searchString.setVisible(true);
		m_moveUp.setVisible( true);
		m_moveDown.setVisible( true);
		m_tone1.setVisible( false);
		m_tone2.setVisible( false);
		m_tone3.setVisible( false);
		m_tone4.setVisible( false);
		m_keyboard =new Ckeyboard( this, m_rect.left()+6, m_rect.bottom()-24, KEYBOARD_UPPERCASE);
		m_clear.setVisible( false);
		break;

	case LAYOUT_FOOD2:
		m_handWriter.setVisible( false);
		m_radicalList.setVisible( false);
		m_symbolList.setVisible( true);
		m_symbolList.setSpan( m_rect.width()/30);
		m_symbolList.setRect( m_rect.offset( 0,12, m_rect.width(), 4*6));
		m_shift.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_pinyin.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_food.setColours( COLOUR("COLOUR_SELECTED_TEXT"), COLOUR("COLOUR_SELECTED_BACKGROUND"));
		m_hand.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_radical.setColours( COLOUR("COLOUR_BUTTON_TEXT"), COLOUR("COLOUR_BUTTON_BACKGROUND2"));
		m_gum.setVisible(true);
		m_searchString.setVisible(true);
		m_moveUp.setVisible( true);
		m_moveDown.setVisible( true);
		m_tone1.setVisible( false);
		m_tone2.setVisible( false);
		m_tone3.setVisible( false);
		m_tone4.setVisible( false);
		m_keyboard =new Ckeyboard( this, m_rect.left()+6, m_rect.bottom()-24, KEYBOARD_UPPERCASE);
		m_clear.setVisible( false);
		break;
	}
	invalidate();
}

/*============================================================================*/
///
///  @brief 	Keyboard handling. Please override function.
///				Handle key events. Also in sub-dialogs for items and menu.
///
///  @param		mod [in] Mode like SHIFT, TAB, CTRL etc.
///  @param		sym [in] Symbol typed.
///
///  @post      Key handled then DIALOG_EVENT_PROCESSED.
///
/*============================================================================*/
Estatus CstringDialog::onButton( SDLMod mod, keybutton sym)
{
	(void)mod;
	switch (sym)
	{
	case KEY_F1:
	case KEY_F2:
	case KEY_F3:
	case KEY_F4:
		setTone( sym-KEY_F1+1);
		switch ( m_layout)
		{
		case LAYOUT_LOCAL:
		case LAYOUT_LOCAL_CAPITAL:
			setLayout( LAYOUT_PINYIN);
			break;
		default:
			break;
		}
		findPinyinSymbols();
		break;

	case KEY_F8:
		m_pinyinString ="";
		m_symbolList.setSymbols( m_pinyinString);
		m_searchString.setText( m_pinyinString);
		invalidate();
		break;

	case KEY_LEFT:
		if ( m_cursor >0)
		{
			m_cursor--;
		}
		invalidate();
		break;

	case KEY_UP:
		m_symbolList.scrollRelative(-60, false);
		break;

	case KEY_DOWN:
		m_symbolList.scrollRelative(60, false);
		break;

	case KEY_F10:
		if ( m_chinese)
		{
			setLayout( LAYOUT_RADICAL);
		}
		break;

	case KEY_F9:
		if ( m_chinese ==true && CFG("handwriting")>0)
		{
			setLayout( LAYOUT_HANDWRITING);
			m_handWriter.clearImage();
			invalidate();
		}
		break;

	case KEY_RIGHT:
		if ( m_cursor <=(int)m_string.length())
		{
			m_cursor++;
			invalidate();
		}
		break;

	case KEY_PAGEDOWN:
		m_symbolList.scrollRelative( 3, true);
		break;

	case KEY_PAGEUP:
		m_symbolList.scrollRelative( -3, true);
		break;
	case KEY_SHIFT_F1:
	case KEY_SHIFT_F2:
		invalidate();
		break;

	case KEY_F5: // shift
		switch ( m_layout)
		{
		case LAYOUT_LOCAL:
			m_layout =LAYOUT_LOCAL_CAPITAL;
			break;

		case LAYOUT_LOCAL_CAPITAL:
#ifdef KEY_SPECIALS
			m_layout =LAYOUT_LOCAL_SPECIAL;
			break;

		case LAYOUT_LOCAL_SPECIAL:
#endif
			m_layout =LAYOUT_LOCAL;
			break;

		case LAYOUT_PINYIN:
		case LAYOUT_FOOD1:
		case LAYOUT_FOOD2:
		default:
			m_layout =LAYOUT_LOCAL;
			break;
		}
		setLayout( m_layout);
		break;

	case KEY_F6: // pinyin
		switch ( m_layout)
		{
		case LAYOUT_LOCAL:
		case LAYOUT_LOCAL_CAPITAL:
#ifdef KEY_SPECIALS
		case LAYOUT_LOCAL_SPECIAL:
#endif
			m_layout =LAYOUT_PINYIN;
			break;

		case LAYOUT_PINYIN:
		case LAYOUT_FOOD1:
		case LAYOUT_FOOD2:
		default:
			m_layout =LAYOUT_PINYIN;
			break;
		}
		setLayout( m_layout);
		break;

	case KEY_END:
		handleBackspace();
		break;

	case KEY_F7:
		m_pinyinString ="";
		m_searchString.setText( m_pinyinString);
		setLayout( (m_layout==LAYOUT_FOOD1 || !m_chinese)
				    ? LAYOUT_FOOD2:LAYOUT_FOOD1);
		m_symbolList.clear();
		m_radicalList.resetPaintedArea();
		m_symbolList.resetPaintedArea();
		invalidate();
		break;

	case KEY_DELETE:
		if ( m_string.length()>0 )
		{
			utf8string zc(m_string);
			if ( m_cursor>=(int)zc.size() && m_cursor>0)
			{
				m_cursor--;
			}
			zc.erase( m_cursor);
			m_string =zc;
			invalidate();
		}
		break;

	case KEY_BACKSPACE:
		if ( m_string.length()>0 && m_cursor>0)
		{
			utf8string zc(m_string);
			zc.erase( m_cursor-1);
			m_string =zc;
			if ( m_cursor>0)
			{
				m_cursor--;
			}
			invalidate();
		}
		break;
	case KEY_CR:
		m_valid =true;
		m_running =false;
		invalidate();
		break;
	case KEY_ESCAPE:
		m_valid =false;
		m_running =false;
		invalidate();
		break;

	default:
		if ( sym >=' ' && sym<='~')
		{
			handleInput( mod, sym);
			invalidate();
			break;
		}
		if ( sym>=(int)KEY_FOUND1 && sym<=(int)KEY_FOUND142)
		{
			int index =m_symbolList.getScrollIndex( sym);
			std::string s =m_symbolList.getValue( index);
			if ( m_layout ==LAYOUT_FOOD2)
			{
				replaceChinese( s);
			}
			else
			{
				insertChinese( s);
			}
			m_handWriter.clearImage();
		}
		if ( sym>=KEY_MAP_ITEM1 && sym<=KEY_MAP_ITEM1000 && m_layout ==LAYOUT_RADICAL)
		{
			int item =m_radicalList.getScrollIndex( sym);
			if ( item >=0)
			{
				touchRadical( item);
				m_radicalList.setCursor( item);
				invalidate();
				m_radicalList.invalidateAll();
			}
		}
		return DIALOG_EVENT_PROCESSED;
	}
	return DIALOG_EVENT_PROCESSED;
}

/** @brief Backspace does things according to which screen we use. */
void CstringDialog::handleBackspace()
{
	if ( m_layout ==LAYOUT_HANDWRITING)
	{
		m_handWriter.clearImage();
		invalidate();
		return;
	}
	if ( m_pinyinString.length() ==0)
	{
		return;
	}
	m_pinyinString.erase( m_pinyinString.begin()+m_pinyinString.length()-1);
	m_searchString.setText( m_pinyinString);
	switch ( m_layout)
	{
	case LAYOUT_PINYIN:
		findPinyinSymbols();
		m_searchString.setText( m_pinyinString);
		break;

	case LAYOUT_FOOD1:
		findFoodSymbols();
		m_searchString.setText( m_pinyinString);
		break;

	case LAYOUT_RADICAL:
		break;

	case LAYOUT_FOOD2:
		findFoodStrings();
		m_searchString.setText( m_pinyinString);
		break;
	default:
		break;
	}
	m_radicalList.resetPaintedArea();
	m_symbolList.resetPaintedArea();
}

/** @brief Key for input method.
 *  @param c [in] Key to handle.
 */
void CstringDialog::handleInput( SDLMod mod, keybutton c)
{
	utf8string zs( m_string);
	char d;
	switch ( m_layout)
	{
	case LAYOUT_LOCAL_CAPITAL:
		d=toupper((char)c);
		break;
	case LAYOUT_LOCAL:
	case LAYOUT_PINYIN:
	case LAYOUT_FOOD1:
	case LAYOUT_FOOD2:
		d=tolower((char)c);
		break;
	default:
		d=(char)c;
		break;
	}
	if ( mod &(KMOD_LSHIFT | KMOD_RSHIFT))
	{
		d ^=0x20;
	}
	switch ( m_layout)
	{
	case LAYOUT_PINYIN:
		if (d<'a' || d>'z')
		{
			break;
		}
		m_pinyinString +=d;
		findPinyinSymbols();
		if (m_foundSymbols.length() ==0 && m_pinyinString.length()>=2)
		{
			m_pinyinString =d;
			findPinyinSymbols();
		}
		m_searchString.setText( m_pinyinString);
		break;

	case LAYOUT_FOOD1:
		if (d<'a' || d>'z')
		{
			break;
		}
		m_pinyinString +=d;
		findFoodSymbols();
		if (m_foundSymbols.length() ==0 && m_pinyinString.length()>=2)
		{
			m_pinyinString =d;
			findFoodSymbols();
		}
		m_searchString.setText( m_pinyinString);
		break;

	case LAYOUT_RADICAL:
	case LAYOUT_HANDWRITING:
		break;

	case LAYOUT_FOOD2:
		if (d<'a' || d>'z')
		{
			break;
		}
		m_pinyinString +=d;
		findFoodStrings();
		if (m_translations.getRows() ==0)
		{
			m_pinyinString =d;
			findFoodStrings();
		}
		m_searchString.setText( m_pinyinString);
		break;

	default:
	//case LAYOUT_LOCAL_CAPITAL:
	//case LAYOUT_LOCAL:
	//case LAYOUT_LOCAL_SPECIAL:
		if ( m_cursor >=m_max_string_width)
		{
			break;
		}
		zs.insert( m_cursor++, d);
		m_string =zs;
		break;
	}
}

/** @brief Init the string dialog.
 *  @param string [in] Default value before starting the dialog.
 *  @param flags [in] Some behaviour definition.
 *  @return true on success.
 */
bool CstringDialog::onInit( const std::string &string, int flags)
{
	m_pinyinString ="zhong";
	m_searchString.setText( m_pinyinString);
	findPinyinSymbols();
	utf8string zs(string);
	m_cursor =zs.size();
	m_string =string;
	m_valid =false;
	m_local =(flags & STRING_EDIT_LOCAL) ? true:false;
	m_chinese =(flags & STRING_EDIT_CHINESE) ? true:false;
	m_layout =LAYOUT_LOCAL;
	if ( !m_chinese)
	{
		m_radical.setVisible( false);
		m_pinyin.setVisible( false);
		m_hand.setVisible( false);
		m_food.setVisible( true);
	}
	if ( !m_local)
	{
		m_shift.setVisible( false);
		m_layout =LAYOUT_PINYIN;
	}
	if ( m_local ==false && m_chinese ==false)
	{
		Log.error( "CstringDialog::onInit  No language enabled!!");
	}
	//DarkenAT(0,0, SQUARES_WIDTH, SQUARES_HEIGHT);
	m_spaceIsLanguage =false;
	setLayout( m_layout);
	return true;
}

/*============================================================================*/
///
/// @brief 		Update called regularly, even when no messages are coming.
///
/// @post       Update performed.
///
/*============================================================================*/
void CstringDialog::onUpdate()
{

}

/** @brief do nothing. */
void CstringDialog::paintLocal()
{
}

/** @brief do nothing. */
void CstringDialog::paintWords()
{

}

/** @brief Create names for all the found translactions for FOOD1 and FOOD2 method. */
void CstringDialog::createTranslationNames()
{
	m_symbolsHorizontal =m_rect.width()/18;
	m_symbolsVertical =3;

	m_symbolList.clear();
	//m_symbolList.setRect( Crect( m_rect.offset( 0,12, m_rect.width(), 3*8)));
	//m_symbolList.setSpan( m_symbolsHorizontal);

	for (int g = 0; g<(int)m_translations.getRows(); g++)
	{
		CsqlMenuTranslation mt =m_translations[ g];
		if ( m_chinese)
		{
			m_symbolList.push_back( (std::string)mt.m_chineseName);
		}
		else
		{
			m_symbolList.push_back( (std::string)mt.m_localName);
		}
	}
	m_symbolList.invalidate();
}

/** @brief Find all the pinyin symbols and convert them to a list of chinese symbols. */
void CstringDialog::findPinyinSymbols()
{
	m_pinyinMethod.find( m_pinyinString, m_selectedTone, m_foundSymbols);
	m_symbolList.setSymbols( m_foundSymbols);
}

/** @brief Convert food symbols from translation table to the list on screen. */
void CstringDialog::findFoodSymbols()
{
	m_translations.findTranslation( m_pinyinString, m_foundSymbols);
	m_symbolList.setSymbols( m_foundSymbols);
}

/** @brief Find a list of food strings which resemble the name we typed. */
void CstringDialog::findFoodStrings()
{
	m_translations.findLike( m_pinyinString);
	createTranslationNames();
}

/** @brief Clear the screen during painting of the display. */
void CstringDialog::onClearScreen()
{
    Cbackground( NULL, m_rect, KEY_NONE, COLOUR("COLOUR_MESSAGEBOX_BACKGROUND2"),
    		     0, FILL_GRADIENT, COLOUR("COLOUR_MESSAGEBOX_BACKGROUND1")).onPaint(0);
	if ( m_layout ==LAYOUT_PINYIN || m_layout ==LAYOUT_FOOD1 || m_layout ==LAYOUT_FOOD2)
	{
		ColorAT( m_rect.left(), m_rect.bottom()-24, m_rect.width(), 18, COLOUR("COLOUR_DARK_BACKGROUND") );
	}
	else
	{
		ColorAT( m_rect.left(), m_rect.bottom()-45, m_rect.width(), 36, COLOUR("COLOUR_DARK_BACKGROUND") );
	}
}

/*============================================================================*/
///
///  @brief 	Paint the dialog once. Use invalidate() to re-paint soon.
///
///	 @pre		Called when dialog is invalidated.
///
///  @post		Dialog updated. Buttons, drag and background are done automatic.
///
/*============================================================================*/
void CstringDialog::onPaint()
{
 	Log.write("begin CstringDialog::onPaint");
	std::string str=m_string;
	if ( m_string.length()==0)
	{
		str =m_hint;
	}
	str +=" ";
	CtextButton txt( this, Crect(m_rect.left()+2, m_rect.top(), m_rect.width()-4, //m_edit_width,
			                     m_edit_height),
			         KEY_NUMBER, str);
	txt.setCursor( m_cursor);
	txt.setLabel("");
	txt.onPaint(0);
	//Ctext( this, Crect(m_rect.left(), m_rect.top(), m_edit_width, m_edit_height),
	//		KEY_NUMBER, (Sfont)CtextFont("edit_string"),
	//		str, COLOUR("COLOUR_SELECTED_TEXT"), GRAVITY_LEFT, m_cursor,
	//		COLOUR("COLOUR_SELECTED_BACKGROUND")).onPaint();
	m_searchString.onPaint(0);
	//sonDisplay();
	Log.write("end CstringDialog::onPaint");
}

/** @brief Final cleanup. */
void CstringDialog::onCleanup()
{
}

/** @brief Only for layout handwriting we want to push a line to the array. */
void CstringDialog::onDragRelease( const Cpoint &position, CdialogObject * movingObject)
{
	(void)position;
	(void)movingObject;
	if ( m_layout ==LAYOUT_HANDWRITING)
	{
		utf8string f;
		m_symbolList.clear();
		for ( size_t n=0; n<14; n++)
		{
			std::string s =m_handWriter.get(n);
			m_symbolList.push_back( s);
		}
		Log.write( "new found symbols =%d", m_symbolList.size());
		m_symbolList.invalidate();
	}
}

/** @brief We drag the finger to paint a chinese character on screen. */
void CstringDialog::onDrag( const Cpoint &position)
{
	(void)position;
	Cpoint p=CdialogEvent::Instance()->lastMouse();
	if ( m_handWriter.m_rect.inside( p/8))
	{
		m_handWriter.onDrag( p);
		CdialogObject *dd=dynamic_cast<CdialogObject*>( &m_handWriter);
		if (dd) dd->onPaint(0);
		m_graphics->update( m_handWriter.left(), m_handWriter.top(), m_handWriter.width(), m_handWriter.height());
	}
}

#endif
